<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>關於 2020，還有 2021 - Hexo</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">





    <meta name="description" content="&amp;#x53C8;&amp;#x5230;&amp;#x4E86; 12 &amp;#x6708;&amp;#x5E95;&amp;#xFF0C;&amp;#x81EA;&amp;#x5DF1;&amp;#x89BA;&amp;#x5F97;&amp;#x9019;&amp;#x662F;&amp;#x4E00;&amp;#x5E74;&amp;#x88E1;&amp;#x9762;&amp;#x6700;&amp;#x4E0D;&amp;#x7531;&amp;#x81EA;&amp;#x4E3B;&amp;#x7684;&amp;#x4E00;&amp;#x6BB5;&amp;#x6">
<meta property="og:type" content="article">
<meta property="og:title" content="關於 2020，還有 2021">
<meta property="og:url" content="http://yoursite.com/2021/01/02/2020_2021/index.html">
<meta property="og:site_name" content="Hexo">
<meta property="og:description" content="&amp;#x53C8;&amp;#x5230;&amp;#x4E86; 12 &amp;#x6708;&amp;#x5E95;&amp;#xFF0C;&amp;#x81EA;&amp;#x5DF1;&amp;#x89BA;&amp;#x5F97;&amp;#x9019;&amp;#x662F;&amp;#x4E00;&amp;#x5E74;&amp;#x88E1;&amp;#x9762;&amp;#x6700;&amp;#x4E0D;&amp;#x7531;&amp;#x81EA;&amp;#x4E3B;&amp;#x7684;&amp;#x4E00;&amp;#x6BB5;&amp;#x6">
<meta property="og:locale" content="en_US">
<meta property="og:image" content="https://imgur.com/3pwnPWp.jpg">
<meta property="og:image" content="https://imgur.com/SGY0ZY4.jpg">
<meta property="og:image" content="https://imgur.com/1ZfubJb.jpg">
<meta property="article:published_time" content="2021-01-02T13:00:00.000Z">
<meta property="article:modified_time" content="2021-01-02T23:00:26.767Z">
<meta property="article:author" content="John Doe">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="https://imgur.com/3pwnPWp.jpg">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 5.1.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">Archives</a>
            
            <a class="navbar-item "
               href="/about">About</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="Search" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" target="_blank" rel="noopener" href="https://github.com/Lauviah0622">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            關於 2020，還有 2021
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2021-01-02T13:00:00.000Z" itemprop="datePublished">Jan 2 2021</time>
            
        </span>
        
        
        <span class="column is-narrow">
            
            
            an hour read (About 9535 words)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x53C8;&#x5230;&#x4E86; 12 &#x6708;&#x5E95;&#xFF0C;&#x81EA;&#x5DF1;&#x89BA;&#x5F97;&#x9019;&#x662F;&#x4E00;&#x5E74;&#x88E1;&#x9762;&#x6700;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x7684;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x8AAA;&#x5B63;&#x7BC0;&#xFF1F;</p>
<p>&#x5929;&#x6C23;&#x51B7;&#x5230;&#x4E0D;&#x884C;&#x8B93;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x5FD7;&#x529B;&#x5927;&#x6253;&#x6298;&#x6263;&#xFF08;&#x7576;&#x7136;&#x9019;&#x4E26;&#x4E0D;&#x4EE3;&#x8868;&#x590F;&#x5929;&#x6703;&#x6BD4;&#x8F03;&#x597D;&#xFF09;&#xFF0C;&#x60F3;&#x505A;&#x4EC0;&#x9EBC;&#x7684;&#x90A3;&#x7A2E;&#x4F01;&#x5716;&#x5FC3;&#x7684;&#x597D;&#x50CF;&#x90FD;&#x6703;&#x88AB;&#x68C9;&#x88AB;&#x963B;&#x64CB;&#x3002;&#x9084;&#x6709;&#x5317;&#x90E8;&#x7684;&#x5929;&#x6C23;&#x56B4;&#x91CD;&#x5F71;&#x97FF;&#x4E86;&#x5916;&#x51FA;&#x7684;&#x898F;&#x5283;&#xFF0C;&#x60F3;&#x51FA;&#x9580;&#x8D70;&#x8D70;&#x4F46;&#x770B;&#x5230;&#x4E0B;&#x96E8;&#x5C31;&#x6703;&#x6253;&#x9000;&#x5802;&#x9F13;&#x3002;&#x52A0;&#x4E0A;&#x6BCF;&#x5E74;&#x5E74;&#x5E95;&#x7E3D;&#x662F;&#x4E00;&#x5806;&#x8CFC;&#x7269;&#x4FC3;&#x92B7;&#xFF0C;&#x885D;&#x52D5;&#x6D88;&#x8CBB;&#x7684;&#x6A5F;&#x6703;&#x771F;&#x7684;&#x5927;&#x589E;&#x3002;&#x4E00;&#x5806;&#x539F;&#x56E0;&#x8B93;&#x6211;&#x89BA;&#x5F97;&#x597D;&#x50CF;&#x5341;&#x4E8C;&#x6708;&#x7684;&#x6240;&#x6709;&#x898F;&#x5283;&#x90FD;&#x6C92;&#x6709;&#x610F;&#x7FA9;&#x4E00;&#x6A23;&#x3002;</p>
<p>&#x7136;&#x5F8C;&#x5341;&#x4E8C;&#x6708;&#x53C8;&#x662F;&#x4E86;&#x4E00;&#x5E74;&#x7684;&#x7D50;&#x5C3E;&#xFF08;&#x683C;&#x91CC;&#x66C6;&#xFF0C;&#x5C31;&#x662F;&#x570B;&#x6B77;&#xFF09;&#xFF0C;&#x81EA;&#x5DF1;&#x4E0D;&#x662F;&#x90A3;&#x7A2E;&#x89BA;&#x5F97;&#x8DE8;&#x5E74;&#x662F;&#x6709;&#x5225;&#x610F;&#x7FA9;&#x7684;&#x4EBA;&#xFF0C;&#x8AAA;&#x5230;&#x5E95;&#x5982;&#x679C;&#x53EA;&#x662F;&#x9700;&#x8981;&#x4E00;&#x500B;&#x9031;&#x671F;&#x6027;&#x7684;&#x7BC0;&#x65E5;&#xFF0C;&#x4E00;&#x5E74;&#x4E2D;&#x7684;&#x4E0D;&#x7BA1;&#x5E7E;&#x865F;&#x90FD;&#x884C;&#x5427;&#xFF1F;&#x5C31;&#x50CF;&#x96D9; 11 &#x6216;&#x8005;&#x662F; &#x96D9; 12 &#x9019;&#x7A2E;&#x5546;&#x4EBA;&#x7092;&#x4F5C;&#x51FA;&#x4F86;&#x7684;&#x7BC0;&#x65E5;&#x5927;&#x5BB6;&#x4E5F;&#x662F;&#x904E;&#x5F97;&#x5F88;&#x958B;&#x5FC3;&#x3002;&#x4E0D;&#x904E;&#x4E5F;&#x77E5;&#x9053;&#x8A71;&#x53EF;&#x4E0D;&#x662F;&#x9019;&#x9EBC;&#x8AAA;&#xFF0C;&#x9019;&#x7A2E;&#x4E8B;&#x60C5;&#x5C31;&#x6709;&#x9EDE;&#x50CF;&#x7562;&#x696D;&#x5178;&#x79AE;&#x548C;&#x5165;&#x5B78;&#x5178;&#x79AE;&#x4E00;&#x6A23;&#xFF0C;&#x662F;&#x4E00;&#x500B;&#x7D50;&#x675F;&#x65BC;&#x958B;&#x59CB;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x96D6;&#x7136;&#x525B;&#x525B;&#x9019;&#x6A23;&#x8B1B;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x8A8D;&#x540C;&#x7684;&#x662F;&#x6176;&#x795D;&#x9019;&#x500B;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x5225;&#x7684;&#x610F;&#x7FA9;&#xFF0C;&#x50CF;&#x662F;&#x300C;&#x6AA2;&#x8996;&#x300D;&#x3001;&#x300C;&#x56DE;&#x9867;&#x300D;&#x3001;&#x300C;&#x5C55;&#x671B;&#x300D;&#x9019;&#x4E9B;&#x610F;&#x7FA9;&#xFF0C;&#x6211;&#x89BA;&#x5F97;&#x9084;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x6700;&#x8FD1;&#x767C;&#x73FE;&#x5728; Twitter &#x4E0A;&#x9762;&#x770B;&#x5230;&#x5F88;&#x591A;&#x4EBA;&#x958B;&#x59CB;&#x505A;&#x4E00;&#x5E74;&#x7684;&#x56DE;&#x9867;&#x548C;&#x65B0;&#x5E74;&#x65B0;&#x5E0C;&#x671B;&#xFF0C;&#x5176;&#x5BE6;&#x81EA;&#x5DF1;&#x4E5F;&#x6709;&#x9019;&#x6A23;&#x7684;&#x4E00;&#x500B;&#x7FD2;&#x6163;&#x6216;&#x8005;&#x8AAA;&#x8DDF;&#x98A8;&#x3002;&#x7684;&#x78BA;&#xFF0C;&#x76F8;&#x8F03;&#x4EBA;&#x751F;&#x5176;&#x4ED6;&#x90E8;&#x4EFD;&#xFF0C;&#x81EA;&#x5DF1;&#x9019;&#x4E00;&#x5E74;&#x7684;&#x78BA;&#x6709;&#x5F88;&#x591A;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x5728;&#x5404;&#x7A2E;&#x610F;&#x7FA9;&#x4E0A;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x5728;&#x9019;&#x500B;&#x6642;&#x9593;&#x505A;&#x4E00;&#x500B;&#x81EA;&#x5DF1;&#x7684;&#x56DE;&#x9867;&#x4EE5;&#x53CA;&#x6240;&#x8B02;&#x7684;&#x65B0;&#x5E74;&#x65B0;&#x5E0C;&#x671B;&#x7684;&#x78BA;&#x5C0D;&#x81EA;&#x5DF1;&#x662F;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6709;&#x9EDE;&#x53CD;&#x4E3B;&#x6D41;&#x7684;&#x6211;&#x4E5F;&#x8981;&#x8DDF;&#x4E0A;&#x9019;&#x500B;&#x98A8;&#x6F6E;&#x4E86;&#x3002;&#x5148;&#x60F3;&#x60F3;&#x8AAA; 2020 &#x81EA;&#x5DF1;&#x767C;&#x751F;&#x4EC0;&#x9EBC;&#x597D;&#x4E86;&#x3002;</p>
<h3 id="&#x7562;&#x696D;&#x4E86;"><a href="#&#x7562;&#x696D;&#x4E86;" class="headerlink" title="&#x7562;&#x696D;&#x4E86;"></a>&#x7562;&#x696D;&#x4E86;</h3><p>&#x662F;&#x7684;&#xFF0C;&#x7D42;&#x65BC;&#x7562;&#x696D;&#x4E86;&#x3002;</p>
<p>&#x5176;&#x5BE6;&#x5C0D;&#x65BC;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x5B78;&#x6B77;&#x7A0B;&#x4E00;&#x76F4;&#x90FD;&#x5E36;&#x6709;&#x4E00;&#x9EDE;&#x81EA;&#x5351;&#x611F;&#xFF0C;&#x7576;&#x6709;&#x4EBA;&#x63D0;&#x8D77;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#x6642;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x6703;&#x7528;&#x81EA;&#x5632;&#x548C;&#x6253;&#x54C8;&#x54C8;&#x5E36;&#x904E;&#xFF0C;&#x4F46;&#x73FE;&#x5728;&#x7562;&#x696D;&#x4E86;&#xFF0C;&#x4E5F;&#x662F;&#x6642;&#x5019;&#x8A72;&#x9762;&#x5C0D;&#x9019;&#x6BB5;&#x5927;&#x5B78;&#x751F;&#x6DAF;&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x5927;&#x5B78;&#x7E3D;&#x5171;&#x8B80;&#x4E86;&#x516D;&#x5E74;&#xFF0C;&#x7B2C;&#x4E00;&#x4E8C;&#x5E74;&#x662F;&#x6DE1;&#x6C5F;&#x5927;&#x5B78;&#x5316;&#x6750;&#x7CFB;&#xFF0C;&#x5927;&#x4E00;&#x6642;&#x6C92;&#x4EC0;&#x9EBC;&#x5728;&#x8A8D;&#x771F;&#x8B80;&#x66F8;&#xFF0C;&#x5E7E;&#x4E4E;&#x90FD;&#x5728;&#x6253;&#x7403;&#xFF0C;&#x5927;&#x4E00;&#x4E0B;&#x7684;&#x6642;&#x5019;&#x9032;&#x5165;&#x793E;&#x5718;&#xFF0C;&#x7136;&#x5F8C;&#x5927;&#x4E8C;&#x5E7E;&#x4E4E;&#x90FD;&#x5728;&#x793E;&#x5718;&#x3002;&#x8A18;&#x5F97;&#x81EA;&#x5DF1;&#x9AD8;&#x4E2D;&#x525B;&#x7562;&#x696D;&#x7684;&#x6642;&#x5019;&#x5F88;&#x52AA;&#x529B;&#x7684;&#x62CD;&#x4E86;&#x4E00;&#x90E8;&#x7562;&#x696D;&#x77ED;&#x7247;&#xFF0C;&#x4E5F;&#x662F;&#x56E0;&#x70BA;&#x9019;&#x90E8;&#x77ED;&#x7247;&#x6240;&#x4EE5;&#x958B;&#x59CB;&#x5C0D;&#x5F71;&#x7247;&#x62CD;&#x651D;&#x6709;&#x8208;&#x8DA3;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x4E8C;&#x6700;&#x5F8C;&#x6C7A;&#x5B9A;&#x91CD;&#x8003;&#x8CC7;&#x50B3;&#x7CFB;&#xFF0C;&#x4E0D;&#x904E;&#x4E5F;&#x56E0;&#x70BA;&#x8003;&#x4E0A;&#x6240;&#x4EE5;&#x624D;&#x8B80;&#x516D;&#x5E74;&#x3002;</p>
<p>&#x8A18;&#x5F97;&#x7576;&#x521D;&#x9032;&#x5165;&#x5927;&#x5B78;&#x7684;&#x6642;&#x5019;&#x5C31;&#x89BA;&#x5F97;&#x5373;&#x4F7F;&#x5EF6;&#x7562;&#x4E5F;&#x6C92;&#x95DC;&#x4FC2;&#xFF0C;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x8B80;&#x5230;&#x4E94;&#x5E74;&#xFF0C;&#x5982;&#x4ECA;&#x591A;&#x4E86;&#x4E00;&#x5E74;&#x3002;&#x73FE;&#x5728;&#x56DE;&#x60F3;&#x8D77;&#x4F86;&#x7576;&#x6642;&#x7684;&#x898F;&#x5283;&#xFF0C;&#x5176;&#x5BE6;&#x9084;&#x662F;&#x7167;&#x8457;&#x7576;&#x521D;&#x5C0D;&#x65BC;&#x5927;&#x5B78;&#x7684;&#x60F3;&#x50CF;&#x8D70;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x591A;&#x4E86;&#x4E00;&#x5E74;&#x4EE5;&#x5916;&#x3002;&#x4F46;&#x6211;&#x73FE;&#x5728;&#x7684;&#x770B;&#x6CD5;&#x662F;&#xFF0C;&#x516D;&#x5E74;&#x771F;&#x7684;&#x592A;&#x4E45;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x6211;&#x89BA;&#x7684;&#x9019;&#x516D;&#x5E74;&#x7684;&#x6536;&#x7A6B;&#x8207;&#x82B1;&#x8CBB;&#x7684;&#x6642;&#x9593;&#x4E26;&#x4E0D;&#x6210;&#x6B63;&#x6BD4;&#x5427;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x5E74;&#x662F;&#x8CC7;&#x50B3;&#x7CFB;&#x4E00;&#x5E74;&#x7684;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x9019;&#x4E00;&#x5E74;&#x7684;&#x91CD;&#x5FC3;&#x653E;&#x5728;&#x793E;&#x5718;&#x9084;&#x6709;&#x7CFB;&#x4E0A;&#x7684;&#x8AB2;&#x696D;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x53C8;&#x662F;&#x793E;&#x5718;&#x3002;&#x4E0D;&#x904E;&#x5176;&#x5BE6;&#x9019;&#x5E74;&#x6709;&#x500B;&#x91CD;&#x8981;&#x7684;&#x8D77;&#x9EDE;&#xFF0C;&#x6211;&#x662F;&#x5728;&#x9019;&#x4E00;&#x5E74;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89F8;&#x5230;&#x7A0B;&#x5F0F;&#x7684;&#xFF0C;&#x662F;&#x5728;&#x4E00;&#x500B;&#x7CFB;&#x4E0A;&#x7684;&#x4E00;&#x500B;&#x53EB;&#x505A;&#x5A92;&#x9AD4;&#x7684;&#x7D44;&#x7E54;&#x63A5;&#x89F8;&#x7684;&#xFF0C;&#x7576;&#x6642;&#x96D6;&#x7136;&#x662F;&#x5927;&#x4E00;&#x4F46;&#x6709;&#x53BB;&#x65C1;&#x807D;&#x5B78;&#x9577;&#x89E3;&#x4E0A;&#x7684;&#x8AB2;&#x7A0B;&#x3002;&#x5728;&#x771F;&#x6B63;&#x63A5;&#x89F8;&#x5230;&#x7A0B;&#x5F0F;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x89BA;&#x5F97;&#x7A0B;&#x5F0F;&#x662F;&#x4E00;&#x500B;&#x5F88;&#x96E3;&#x7684;&#x6771;&#x897F;&#xFF0C;&#x53EF;&#x662F;&#x53C8;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x601D;&#x8003;&#x65B9;&#x9762;&#x5F88;&#x9069;&#x5408;&#x5BEB;&#x7A0B;&#x5F0F;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x76F4;&#x6C92;&#x6709;&#x6A5F;&#x6703;&#x63A5;&#x89F8;&#xFF0C;&#x4E0D;&#x904E;&#x7576;&#x6642;&#x9084;&#x6C92;&#x6709;&#x60F3;&#x8981;&#x5C08;&#x5FC3;&#x8D70;&#x524D;&#x7AEF;&#xFF0C;&#x53CD;&#x800C;&#x4E00;&#x6A23;&#x662F;&#x5C0D;&#x5F71;&#x7247;&#xFF0C;&#x9084;&#x6709;&#x884C;&#x92B7;&#x548C;&#x5EE3;&#x544A;&#x6BD4;&#x8F03;&#x6709;&#x8208;&#x8DA3;&#x3002;</p>
<p>&#x76F4;&#x5230;&#x7B2C;&#x56DB;&#x5E74;&#x624D;&#x6C7A;&#x5B9A;&#x8981;&#x8D70;&#x524D;&#x7AEF;&#xFF0C;&#x7B2C;&#x56DB;&#x5E74;&#x624D;&#x767C;&#x73FE;&#x4E00;&#x898B;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x7684;&#x5B78;&#x8CB8;&#x6703;&#x662F;&#x53EF;&#x89C0;&#x7684;&#x91D1;&#x984D;&#xFF0C;&#x5230;&#x9019;&#x500B;&#x6642;&#x5019;&#x5C31;&#x5927;&#x6982;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x6703;&#x9700;&#x8981;&#x8B80;&#x516D;&#x5E74;&#x4E86;&#xFF0C;&#x52A0;&#x4E0A;&#x81EA;&#x5DF1;&#x9664;&#x4E86;&#x5B78;&#x8CBB;&#x4EE5;&#x5916;&#x9084;&#x6709;&#x8CB8;&#x751F;&#x6D3B;&#x8CBB;&#xFF08;&#x623F;&#x79DF;&#xFF09;&#x3002;&#x9AD4;&#x609F;&#x5230;&#x9019;&#x9EDE;&#x5F8C;&#x7406;&#x89E3;&#x5230;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;</p>
<blockquote>
<p>&#x81EA;&#x5DF1;&#x5C0D;&#x672A;&#x4F86;&#x7684;&#x5DE5;&#x4F5C;&#x6709;&#x6240;&#x8981;&#x6C42;&#xFF0C;&#x5305;&#x542B;&#x4F46;&#x4E0D;&#x50C5;&#x9650;&#x65BC;&#x7D93;&#x6FDF;&#x5C64;&#x9762;</p>
</blockquote>
<p>&#x60F3;&#x60F3;&#x9019;&#x6642;&#x5019;&#x7684;&#x6280;&#x80FD;&#x6A39;&#x9EDE;&#x4E86;&#x4EC0;&#x9EBC;&#xFF1F;&#x9019;&#x6642;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x80FD;&#x6A39;&#x771F;&#x7684;&#x662F;&#x4E82;&#x7684;&#x53EF;&#x4EE5;&#xFF1A;&#x5E73;&#x9762;&#x8A2D;&#x8A08;&#x3001;&#x5F71;&#x7247;&#x526A;&#x8F2F;&#x3001;&#x524D;&#x7AEF;&#x3001;&#x7DB2;&#x9801;&#x8A2D;&#x8A08;&#x3001;&#x884C;&#x92B7;&#x7B49;&#x7B49;&#x7684;&#x90FD;&#x7565;&#x61C2;&#xFF0C;&#x4F46;&#x8AAA;&#x5BE6;&#x5728;&#x7684;&#x6C92;&#x6709;&#x4E00;&#x6A23;&#x80FD;&#x5920;&#x898B;&#x4EBA;&#x7684;&#x3002;</p>
<p>&#x6211;&#x89BA;&#x5F97;&#x5C31;&#x7B97;&#x662F;&#x901A;&#x624D;&#xFF0C;&#x4E5F;&#x5FC5;&#x9808;&#x8981;&#x5728;&#x4E00;&#x500B;&#x65B9;&#x9762;&#x947D;&#x7814;&#x7684;&#x6DF1;&#xFF0C;&#x986F;&#x7136;&#x73FE;&#x5728;&#x7684;&#x6211;&#x4E0D;&#x662F;&#xFF0C;&#x4EC0;&#x9EBC;&#x90FD;&#x78B0;&#xFF0C;&#x4F46;&#x4EC0;&#x9EBC;&#x90FD;&#x4E0D;&#x7CBE;&#x3002;&#x6700;&#x5F8C;&#x8003;&#x616E;&#x5230;&#x7D93;&#x6FDF;&#x4E0A;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5728;&#x7B2C;&#x4E8C;&#x6B21;&#x7684;&#x5927;&#x4E8C;&#x4E0B;&#x5B78;&#x671F;&#x6C7A;&#x5B9A;&#x8D70;&#x5411;&#x524D;&#x7AEF;&#xFF08;&#x7E3D;&#x89BA;&#x5F97;&#x6BCF;&#x6B21;&#x5927;&#x4E8C;&#x4E0B;&#x90FD;&#x5F97;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x6C7A;&#x5B9A;&#xFF09;&#xFF0C;&#x4E0D;&#x904E;&#x9019;&#x6642;&#x5019;&#x9084;&#x6C92;&#x6709;&#x5230;&#x975E;&#x5E38;&#x4E0A;&#x5FC3;&#xFF0C;&#x53EA;&#x662F;&#x4E0A; Udemy &#x627E;&#x4E00;&#x4E9B;&#x6559;&#x6750;&#x7A0D;&#x5FAE;&#x770B;&#x4E00;&#x770B;&#x3002;&#x76F4;&#x5230;&#x5927;&#x4E09;&#x4E0B;&#x624D;&#x958B;&#x59CB;&#x7B97;&#x6709;&#x898F;&#x5283;&#x7684;&#x5B78;&#x7FD2;&#xFF08;&#x4F46;&#x5176;&#x5BE6;&#x4E5F;&#x662F;&#x8DDF;&#x8AB2;&#xFF09;&#x3002;</p>
<p>&#x5927;&#x4E09;&#x4E0B;&#x6709;&#x500B;&#x7279;&#x5225;&#x7684;&#x9EDE;&#xFF0C;&#x56E0;&#x70BA;&#x539F;&#x672C;&#x5728;&#x5B78;&#x7FD2;&#x7A0B;&#x5F0F;&#x6642;&#xFF0C;&#x5C31;&#x662F;&#x5F9E;&#x7DB2;&#x9801;&#x8A2D;&#x8A08;&#x958B;&#x59CB;&#x5B78;&#x7FD2;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5C0D;&#x65BC; UI/UX &#x7684;&#x4E86;&#x89E3;&#x6BD4;&#x524D;&#x7AEF;&#x9084;&#x8981;&#x65E9;&#x3002;&#x81EA;&#x5DF1;&#x4E00;&#x76F4;&#x5F88;&#x559C;&#x6B61; UI/UX &#x7684;&#x4E00;&#x4E9B;&#x7406;&#x5FF5;&#xFF0C;&#x50CF;&#x662F;&#x4EE5;&#x4EBA;&#x70BA;&#x672C;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#xFF0C;&#x9084;&#x6709;&#x9700;&#x8981;&#x505A;&#x5BE6;&#x9A57;&#x7684;&#x7CBE;&#x795E;&#xFF0C;&#x9019;&#x5C0D;&#x6211;&#x800C;&#x8A00;&#x6BD4;&#x55AE;&#x7D14;&#x7684;&#x8996;&#x89BA;&#x8A2D;&#x8A08;&#x6709;&#x8DA3;&#x592A;&#x591A;&#x3002;&#x9019;&#x662F;&#x5982;&#x679C;&#x672A;&#x4F86;&#x5982;&#x679C;&#x80FD;&#x529B;&#x6703;&#x60F3;&#x8981;&#x6DF1;&#x9020;&#x7684;&#x4E00;&#x500B;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x6700;&#x5F8C;&#x7D42;&#x65BC;&#x5230;&#x4E86;&#x5927;&#x56DB;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5927;&#x5B78;&#x7684;&#x7B2C;&#x516D;&#x5E74;&#x3002;&#x9019;&#x5E74;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x5F88;&#x8FF7;&#x60D8;&#x4EE5;&#x53CA;&#x7169;&#x8E81;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x53EF;&#x80FD;&#x6BCF;&#x500B;&#x4EBA;&#x591A;&#x5C11;&#x90FD;&#x6703;&#x5728;&#x5927;&#x5B78;&#x751F;&#x6DAF;&#x7684;&#x6700;&#x5F8C;&#x4E00;&#x5E74;&#x611F;&#x5230;&#x8FF7;&#x60D8;&#x5427;&#xFF1F;&#x96E2;&#x958B;&#x5B78;&#x6821;&#x5373;&#x5C07;&#x8E0F;&#x5165;&#x793E;&#x6703;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8981;&#x5E79;&#x561B;&#xFF0C;&#x7E3D;&#x6B78;&#x4E00;&#x53E5;&#x8A71;&#x5C31;&#x662F;&#x5C0D;&#x672A;&#x4F86;&#x7684;&#x4E0D;&#x78BA;&#x5B9A;&#x6027;&#x3002;&#x52A0;&#x4E0A;&#x7CFB;&#x4E0A;&#x53C8;&#x8981;&#x505A;&#x7562;&#x696D;&#x88FD;&#x4F5C;&#xFF0C;&#x81EA;&#x5DF1;&#x6709;&#x500B;&#x58DE;&#x7FD2;&#x6163;&#xFF0C;&#x9019;&#x500B;&#x7FD2;&#x6163;&#x56F0;&#x64FE;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x5F88;&#x4E45;&#xFF1A;&#x7E3D;&#x662F;&#x60F3;&#x8981;&#x5E79;&#x4E00;&#x7968;&#x5927;&#x7684;&#x3002;&#x7562;&#x88FD;&#x4E00;&#x958B;&#x59CB;&#x60F3;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x5BE6;&#x73FE;&#x7684;&#x537B;&#x6C92;&#x6709;&#x591A;&#x5C11;&#x3002;&#x5927;&#x5B78;&#x7684;&#x6700;&#x5F8C;&#x4E00;&#x5E74;&#x5C31;&#x5728;&#x7562;&#x88FD;&#x7684;&#x5FD9;&#x788C;&#x9084;&#x6709;&#x6253;&#x5DE5;&#x3001;&#x5BE6;&#x7FD2;&#x4E0B;&#x6E3E;&#x6E3E;&#x5669;&#x5669;&#x7684;&#x904E;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8981;&#x7D66;&#x81EA;&#x5DF1;&#x4E00;&#x500B;&#x5927;&#x5B78;&#x4E00;&#x500B;&#x5206;&#x6578;&#xFF0C;&#x53EF;&#x80FD;&#x662F; 60 &#x5206;&#xFF1F;&#x7E3D;&#x4E4B;&#x4E0D;&#x6703;&#x662F;&#x592A;&#x9AD8;&#x7684;&#x5206;&#x6578;&#x5C31;&#x662F;&#x4E86;&#xFF0C;&#x4EBA;&#x96E3;&#x514D;&#x6703;&#x70BA;&#x4E00;&#x4EF6;&#x4E8B;&#x7269;&#x6253;&#x5206;&#x6578;&#xFF0C;&#x4F46;&#x6709;&#x8DA3;&#x7684;&#x662F;&#x7576;&#x73FE;&#x5728;&#x56DE;&#x982D;&#x770B;&#x9019;&#x6BB5;&#x6642;&#x9593;&#xFF0C;&#x8207; 10 &#x5E74;&#x5F8C;&#x56DE;&#x982D;&#x770B;&#x5927;&#x5B78;&#x9019;&#x6BB5;&#x6642;&#x9593;&#x4E00;&#x5B9A;&#x6703;&#x7D66;&#x81EA;&#x5DF1;&#x4E0D;&#x540C;&#x7684;&#x8A55;&#x50F9;&#xFF0C;&#x6216;&#x8A31;&#x9019;&#x6BB5;&#x6642;&#x9593;&#x6709;&#x6211;&#x73FE;&#x5728;&#x9084;&#x4E0D;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x6536;&#x7A6B;&#xFF0C;&#x53C8;&#x6216;&#x8A31;&#x9019;&#x6BB5;&#x6642;&#x9593;&#x5E36;&#x4F86;&#x6211;&#x73FE;&#x5728;&#x6C92;&#x5BDF;&#x89BA;&#x7684;&#x554F;&#x984C;&#x3002;&#x4E0D;&#x904E;&#x6709;&#x5728;&#x4EBA;&#x751F;&#x7684;&#x9019;&#x6BB5;&#x6642;&#x9593;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x89BA;&#x5F97;&#x80FD;&#x5920;&#x767C;&#x5C55;&#x3001;&#x81EA;&#x5DF1;&#x4E5F;&#x559C;&#x6B61;&#x7684;&#x5FD7;&#x5411;&#x4E5F;&#x7B97;&#x662F;&#x53CA;&#x683C;&#x4E86;&#xFF1B;&#x4F46;&#x4E5F;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x70BA;&#x4E86;&#x9019;&#x5F35;&#x7562;&#x696D;&#x8B49;&#x66F8;&#x6D6A;&#x8CBB;&#x4E86;&#x592A;&#x591A;&#x8CC7;&#x6E90;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5728;&#x4E4E;&#x9019;&#x5F35;&#x8B49;&#x66F8;&#x7684;&#x8A71;&#xFF0C;&#x6216;&#x8A31;&#x80FD;&#x5728;&#x9019;&#x6BB5;&#x6642;&#x9593;&#x505A;&#x66F4;&#x591A;&#x4E8B;&#x60C5;&#xFF1F;</p>
<p>&#x7E3D;&#x4E4B;&#x516D;&#x5E74;&#x5927;&#x5B78;&#x751F;&#x6D3B;&#x5C31;&#x5230;&#x9019;&#x88E1;&#x4E86;&#xFF0C;&#x7576;&#x7136;&#x6709;&#x5F88;&#x591A;&#x7D30;&#x7BC0;&#x6C92;&#x6709;&#x63D0;&#xFF0C;&#x6392;&#x7403;&#x3001;&#x793E;&#x5718;&#x3001;&#x9084;&#x6709;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x4EE5;&#x53CA;&#x6709;&#x5F88;&#x591A;&#x9700;&#x8981;&#x611F;&#x8B1D;&#x548C;&#x9700;&#x8981;&#x8AAA;&#x8072;&#x62B1;&#x6B49;&#x7684;&#x4EBA;&#x3002;&#x4E0D;&#x8AD6;&#x9019;&#x6BB5;&#x6642;&#x9593;&#x6211;&#x81EA;&#x5DF1;&#x89BA;&#x5F97;&#x5982;&#x4F55;&#xFF0C;&#x4E0D;&#x53EF;&#x5426;&#x8A8D;&#x7684;&#x662F;&#xFF0C;&#x9019;&#x662F;&#x6211;&#x7684;&#x4EBA;&#x751F;&#x5F88;&#x91CD;&#x8981;&#x4E00;&#x500B;&#x90E8;&#x4EFD;&#x3002;&#x5982;&#x679C;&#x8AAA;&#x8A8D;&#x77E5;&#x6709;&#x56DB;&#x500B;&#x968E;&#x6BB5;</p>
<ol>
<li>&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4E0D;&#x77E5;&#x9053;</li>
<li>&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4E0D;&#x77E5;&#x9053;</li>
<li>&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x77E5;&#x9053;</li>
<li>&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x77E5;&#x9053;</li>
</ol>
<p>&#x5728;&#x5927;&#x5B78;&#x4EE5;&#x524D;&#x7684;&#x6211;&#x662F; 1. &#x90A3;&#x5927;&#x5B78;&#x4E4B;&#x5F8C;&#x7684;&#x81EA;&#x5DF1;&#x61C9;&#x8A72;&#x7B97;&#x662F;&#x9032;&#x5165; 2. &#x4E86;&#x3002;</p>
<h3 id="&#x524D;&#x7AEF;"><a href="#&#x524D;&#x7AEF;" class="headerlink" title="&#x524D;&#x7AEF;"></a>&#x524D;&#x7AEF;</h3><p>&#x81EA;&#x5DF1;&#x5927;&#x6982;&#x662F;&#x5728;&#x5927;&#x56DB;&#x4E0A;&#x5B78;&#x671F;&#xFF0C;&#x624D;&#x958B;&#x59CB;&#x548C;&#x8EAB;&#x65C1;&#x7684;&#x4EBA;&#x8AAA;&#x81EA;&#x5DF1;&#x672A;&#x4F86;&#x65B9;&#x5411;&#x662F;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x5728;&#x4E4B;&#x524D;&#x4E26;&#x6C92;&#x6709;&#x548C;&#x5F88;&#x591A;&#x4EBA;&#x63D0;&#x8D77;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x6C92;&#x6709;&#x5F88;&#x6E05;&#x695A;&#x5176;&#x4ED6;&#x4EBA;&#x5C0D;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x4F46;&#x611F;&#x89BA;&#x61C9;&#x8A72;&#x662F;&#x5E36;&#x8457;&#x6BD4;&#x8F03;&#x534A;&#x61F7;&#x7591;&#x7684;&#x5FC3;&#x614B;&#xFF1F;&#x7562;&#x7ADF;&#x81EA;&#x5DF1;&#x4E5F;&#x63DB;&#x904E;&#x5F88;&#x591A;&#x5FD7;&#x5411;&#xFF0C;&#x800C;&#x4E14;&#x5DE5;&#x7A0B;&#x5E2B;&#x8868;&#x9762;&#x770B;&#x8D77;&#x4F86;&#x81EA;&#x5DF1;&#x7684;&#x79D1;&#x7CFB;&#x4E26;&#x6C92;&#x6709;&#x5F88;&#x5927;&#x7684;&#x95DC;&#x806F;&#xFF08;&#x975E;&#x8CC7;&#x5DE5;&#x7CFB;&#xFF09;&#xFF0C;&#x7136;&#x5F8C;&#x81EA;&#x5DF1;&#x53C8;&#x662F;&#x90A3;&#x7A2E;&#x5E79;&#x8A71;&#x4ED6;&#x5ABD;&#x591A;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x4E0D;&#x904E;&#x89BA;&#x5F97;&#x771F;&#x6B63;&#x7684;&#x539F;&#x56E0;&#x662F;&#x81EA;&#x5DF1;&#x9084;&#x6C92;&#x6709;&#x81EA;&#x4FE1;&#x5427;&#xFF1F;&#x81EA;&#x5DF1;&#x7576;&#x6642;&#x7684;&#x6C34;&#x6E96;&#x5728;&#x5DF2;&#x7D93;&#x53EF;&#x4EE5;&#x5BEB;&#x51FA;&#x4E00;&#x4E9B;&#x7C21;&#x55AE;&#x7684;&#x6771;&#x897F;&#xFF0C;&#x4F46;&#x57FA;&#x790E;&#x4E0D;&#x7A69;&#x3002;&#x6211;&#x89BA;&#x5F97;&#x81EA;&#x5B78;&#x7A0B;&#x5F0F;&#x6700;&#x96E3;&#x7684;&#x5730;&#x65B9;&#x6703;&#x5728;&#x9019;&#x88E1;&#xFF0C;&#x5176;&#x5BE6;&#x7DB2;&#x8DEF;&#x4E0A;&#x6709;&#x5F88;&#x591A; roadmap &#x53EF;&#x4EE5;&#x8DDF;&#xFF0C;&#x8981;&#x5230;&#x53EF;&#x4EE5;&#x5C31;&#x696D;&#x7684;&#x7A0B;&#x5EA6;&#x4E26;&#x4E0D;&#x96E3;&#xFF0C;&#x53EF;&#x662F;&#x57FA;&#x790E;&#x7684;&#x90E8;&#x4EFD;&#x5982;&#x679C;&#x6C92;&#x6709;&#x4EBA;&#x6307;&#x5C0E;&#xFF0C;&#x4F60;&#x6703;&#x8655;&#x65BC;&#x4E00;&#x500B;<strong>&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4E0D;&#x77E5;&#x9053;</strong>&#x7684;&#x72C0;&#x614B;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x9032;&#x5165;&#x8077;&#x5834;&#x4E4B;&#x5F8C;&#x624D;&#x6703;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x5927;&#x6982;&#x8A8D;&#x771F;&#x6295;&#x5165;&#x4E86;&#x516D;&#x4E03;&#x500B;&#x6708;&#x5DE6;&#x53F3;&#xFF08;&#x61C9;&#x8A72;&#x662F; 19 &#x5E74;&#x7684;&#x4E03;&#x6708;&#x958B;&#x59CB;&#x5230; 20 &#x5E74;&#x521D;&#xFF09;&#xFF0C;&#x7136;&#x5F8C;&#x770B;&#x5230;<a target="_blank" rel="noopener" href="https://blog.huli.tw/2019/08/21/real-front-end-learning-path/">&#x9019;&#x7BC7;&#x7167;&#x5996;&#x93E1;</a>&#x5C31;&#x61F5;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E00;&#x6A23;&#x662F;&#x81EA;&#x5B78;&#x5B78;&#x4E86;&#x4E00;&#x5E74;&#x534A;&#x8F09;&#xFF0C;&#x4E0D;&#x78BA;&#x5B9A;&#x81EA;&#x5DF1;&#x5728;&#x9019;&#x8DEF;&#x4E0A;&#x8D70;&#x4E86;&#x591A;&#x9577;&#x6642;&#xFF0C;&#x5EFA;&#x8B70;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x3002;</p>
<p>&#x770B;&#x5B8C;&#x4E4B;&#x5F8C;&#x601D;&#x8003;&#x4E86;&#x4E00;&#x4E0B;&#x5C31;&#x5831;&#x540D;&#x7B2C;&#x56DB;&#x671F;&#x7684;&#x7A0B;&#x5F0F;&#x5C0E;&#x5E2B;&#x5BE6;&#x9A57;&#x8A08;&#x756B;&#x4E86;&#xFF08;&#x5F8C;&#x9762;&#x7C21;&#x7A31; MTR&#xFF09;&#x3002;</p>
<p>&#x9084;&#x6709;&#x5C31;&#x662F;&#x9019;&#x500B;&#x8A08;&#x756B;&#x8981;&#x6C42;&#x5169;&#x500B;&#x79AE;&#x62DC;&#x81F3;&#x5C11;&#x8981; PO &#x5341;&#x7BC7;&#x6BCF;&#x65E5;&#x5FC3;&#x5F97;&#xFF0C;&#x4EE5;&#x53CA;&#x8981;&#x6C42;&#x8AAA;&#x4E00;&#x500B;&#x8981;&#x6295;&#x5165;&#x81F3;&#x5C11; 30 &#x500B;&#x5C0F;&#x6642;&#x8A08;&#x756B;&#x4E0A;&#x3002;&#x9019;&#x5169;&#x9EDE;&#x5C0D;&#x6211;&#x4F86;&#x8AAA;&#x4E0D;&#x7B97;&#x662F;&#x500B;&#x554F;&#x984C;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x672C;&#x4F86;&#x5C31;&#x662F;&#x7121;&#x696D;&#x904A;&#x6C11;&#x3002;</p>
<p><a href></a></p>
<p>&#x5F9E;&#x7A0B;&#x5F0F;&#x958B;&#x59CB;&#x8B1B;&#x8D77;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x60F3;&#x6700;&#x5927;&#x7684;&#x6536;&#x7A6B;&#x61C9;&#x8A72;&#x662F;&#x81EA;&#x4FE1;&#x3002;&#x9019;&#x611F;&#x89BA;&#x5C31;&#x50CF;&#x4F60;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x61C9;&#x8A72;&#x662F;&#x883B;&#x6703;&#x8DD1;&#x6B65;&#x7684;&#xFF0C;&#x56E0;&#x70BA;&#x5728;&#x5B78;&#x6821;&#x7684;&#x904B;&#x52D5;&#x6703;&#x90FD;&#x540D;&#x5217;&#x524D;&#x8305;&#xFF0C;&#x751A;&#x81F3;&#x9084;&#x5E38;&#x5E38;&#x7834;&#x5927;&#x6703;&#x7D00;&#x9304;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x6574;&#x500B;&#x7E23;&#x7D1A;&#x6216;&#x8005;&#x662F;&#x5168;&#x570B;&#x904B;&#x52D5;&#x6703;&#x7684;&#x8868;&#x73FE;&#x600E;&#x9EBC;&#x6A23;&#x3002;</p>
<p>&#x53EF;&#x60DC;&#x6211;&#x4E26;&#x4E0D;&#x662F;&#x90A3;&#x500B;&#x540D;&#x5217;&#x524D;&#x8305;&#x554A;&#xFF0C;&#x9032;&#x4F86;&#x4E4B;&#x5F8C;&#x4E5F;&#x662F;&#x88DC;&#x4E0A;&#x4E86;&#x5F88;&#x591A;&#x4E4B;&#x524D;&#x4E0D;&#x61C2;&#x7684;&#x57FA;&#x790E;&#xFF0C;&#x4F46;&#x6574;&#x500B;&#x516D;&#x500B;&#x6708;&#x7684;&#x8AB2;&#x7A0B;&#x8DDF;&#x5B8C;&#x4E4B;&#x5F8C;&#xFF0C;&#x4E0D;&#x78BA;&#x5B9A;&#x611F;&#x5C11;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x6211;&#x8A8D;&#x70BA;&#x4FE1;&#x5FC3;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#x5C0D;&#x70BA;&#x4E86;&#x5DE5;&#x4F5C;&#x6216;&#x8005;&#x8AAA;&#x8F49;&#x8077;&#x800C;&#x81EA;&#x5B78;&#x7684;&#x4EBA;&#x6703;&#x6BD4;&#x60F3;&#x50CF;&#x4E2D;&#x7684;&#x5927;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x8AC7;&#x85AA;&#x6C34;&#x9084;&#x6709;&#x5C0D;&#x5DE5;&#x4F5C;&#x7684;&#x8981;&#x6C42;&#x65B9;&#x9762;&#xFF0C;&#x6709;&#x4FE1;&#x5FC3;&#x6703;&#x8B93;&#x4F60;&#x66F4;&#x9858;&#x610F;&#x627E;&#x4E00;&#x4EFD;&#x597D;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x518D;&#x4F86;&#x662F;&#x6280;&#x8853;&#x65B9;&#x9762;&#xFF0C;&#x81EA;&#x5DF1;&#x6536;&#x7A6B;&#x6700;&#x591A;&#x7684;&#x90E8;&#x4EFD;&#x7D55;&#x5C0D;&#x4E0D;&#x662F;&#x524D;&#x7AEF;&#xFF0C;&#x800C;&#x662F;&#x5F8C;&#x7AEF;&#x3002;&#x5927;&#x6982;&#x78B0;&#x4E86;&#x4E00;&#x9EDE; PHP&#xFF0C;&#x9084;&#x6709; node &#x8DDF; express&#x3002;&#x5728;&#x4E0A;&#x8AB2;&#x4E4B;&#x5F8C;&#x5C0D;&#x65BC;&#x6846;&#x67B6;&#x9084;&#x6709;&#x5DE5;&#x5177;&#x7684;&#x7406;&#x89E3;&#x4E5F;&#x66F4;&#x6DF1;&#xFF0C;&#x5305;&#x542B;&#x4F46;&#x4E0D;&#x9650;&#x65BC;&#xFF1A;React, webpack &#x7B49;&#x7B49;&#x3002;&#x5176;&#x5BE6;&#x883B;&#x60F3;&#x63D0;&#x8AAA;&#x81EA;&#x5DF1;&#x5C0D;&#x65BC;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E2B;&#x5B78;&#x5F8C;&#x7AEF;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x4E0D;&#x904E;&#x7562;&#x7ADF;&#x9019;&#x7BC7;&#x662F;&#x500B;&#x56DE;&#x9867;&#xFF0C;&#x6709;&#x6A5F;&#x6703;&#x518D;&#x751F;&#x4E00;&#x7BC7;&#x4F86;&#x63D0;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x9084;&#x6709;&#x5C0D;&#x65BC;&#x4E00;&#x4E9B;&#x57FA;&#x790E;&#x7684;&#x6771;&#x897F;&#x4E5F;&#x66F4;&#x52A0;&#x624E;&#x5BE6;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8CC7;&#x5B89;&#x3001;JS &#x5E95;&#x5C64;&#x3001;&#x9084;&#x6709;&#x700F;&#x89BD;&#x5668;&#x65B9;&#x9762;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x5176;&#x5BE6;&#x6211;&#x89BA;&#x5F97;&#x9019;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x6F0F;&#x6389;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x60F3;&#x8D70;&#x66F4;&#x9060;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x653E;&#x904E;&#x5F97;&#x90E8;&#x4EFD;&#x3002;</p>
<p>&#x5728;&#x7A0B;&#x5F0F;&#x7684;&#x90E8;&#x4EFD;&#x4F86;&#x8AAA;&#xFF0C;&#x6700;&#x5F8C;&#x61C9;&#x8A72;&#x662F;&#x773C;&#x754C;&#x5427;&#xFF0C;&#x5728; MTR &#x4E4B;&#x524D;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x7F3A;&#x7684;&#x5F88;&#x591A;&#xFF0C;&#x4E0A;&#x5B8C;&#x4E4B;&#x5F8C;&#x66F4;&#x591A;&#x4E86;&#xFF0C;&#x4E5F;&#x5E0C;&#x671B;&#x672A;&#x4F86;&#x53EF;&#x4EE5;&#x5728;&#x9019;&#x500B;&#x9818;&#x57DF;&#x9054;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x9019;&#x9EDE;&#x4E4B;&#x5916;&#xFF0C;&#x5728;&#x4E0A;&#x5B8C;&#x8AB2;&#x7A0B;&#x4E4B;&#x5F8C;&#x624D;&#x771F;&#x6B63;&#x89BA;&#x5F97;&#x9019;&#x662F;&#x4E00;&#x500B;&#x6709;&#x8DA3;&#x7684;&#x9818;&#x57DF;&#xFF0C;&#x6703;&#x60F3;&#x8981;&#x518D;&#x6DF1;&#x5165;&#x7684;&#x53BB;&#x7814;&#x7A76;&#x9084;&#x6709;&#x7406;&#x89E3;&#x66F4;&#x6DF1;&#x7684;&#x5167;&#x5BB9;&#x3002;&#x9019;&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x904E;&#x53BB;&#x4E00;&#x76F4;&#x5B78;&#x4E0D;&#x597D;&#x7684;&#x4E00;&#x9EDE;&#x4E4B;&#x4E00;&#xFF0C;&#x904E;&#x53BB;&#x5B78;&#x7FD2;&#x7684;&#x904E;&#x7A0B;&#x6709;&#x9EDE;&#x592A;&#x529F;&#x5229;&#x4E86;&#xFF0C;&#x5C31;&#x53EA;&#x662F;&#x70BA;&#x627E;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x800C;&#x5DF2;&#x3002;&#x9019;&#x6A23;&#x7684;&#x60F3;&#x6CD5;&#x4E26;&#x6C92;&#x6709;&#x932F;&#xFF0C;&#x4F46;&#x4E00;&#x500B;&#x9818;&#x57DF;&#x7684;&#x8208;&#x8DA3;&#x6703;&#x8B93;&#x4F60;&#x8D70;&#x5F97;&#x66F4;&#x9060;&#x3002;</p>
<h3 id="&#x548C;&#x7A0B;&#x5F0F;&#x7121;&#x95DC;&#x7684;&#x6771;&#x897F;"><a href="#&#x548C;&#x7A0B;&#x5F0F;&#x7121;&#x95DC;&#x7684;&#x6771;&#x897F;" class="headerlink" title="&#x548C;&#x7A0B;&#x5F0F;&#x7121;&#x95DC;&#x7684;&#x6771;&#x897F;"></a>&#x548C;&#x7A0B;&#x5F0F;&#x7121;&#x95DC;&#x7684;&#x6771;&#x897F;</h3><p>&#x6211;&#x60F3;&#x662F; Huli &#x8001;&#x5E2B;&#x7684;&#x500B;&#x4EBA;&#x7279;&#x8CEA;&#x5427;&#xFF0C;&#x8A18;&#x5F97;&#x5728;&#x8AB2;&#x7A0B;&#x4E2D;&#x7684; podcast &#xFF08;&#x6C92;&#x932F;&#xFF0C;&#x9019;&#x500B;&#x8A08;&#x756B;&#x6709;&#x500B;&#x5167;&#x90E8;&#x9031;&#x66F4;&#x7684; Podcast&#xFF0C;&#x5C0F;&#x5F1F;&#x662F;&#x5FE0;&#x5BE6;&#x807D;&#x773E;&#xFF09;&#x6709;&#x63D0;&#x5230;&#x8AAA; Huli &#x5F88;&#x4F5B;&#x7CFB;&#xFF0C;&#x96D6;&#x7136;&#x6211;&#x6C92;&#x6709;&#x5F88;&#x6E05;&#x695A;&#x8AAA;&#x4F5B;&#x7CFB;&#x662F;&#x4EC0;&#x9EBC;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x89BA;&#x5F97;&#x90A3;&#x7A2E;&#x300C;&#x4E0D;&#xFF38;&#xFF38;&#xFF0C;&#x4E0D;&#xFF38;&#xFF38;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#xFF38;&#xFF38;&#xFF38;&#x300D;&#x3001;&#x6216;&#x8005;&#x662F;&#x4EC0;&#x9EBC;&#x90FD;&#x6F2B;&#x4E0D;&#x5728;&#x4E4E;&#x7684;&#x500B;&#x6027;&#x61C9;&#x8A72;&#x4E0D;&#x662F;&#x4F5B;&#x7CFB;&#xFF0C;&#x6211;&#x7684;&#x89BA;&#x5F97;&#x6BD4;&#x8F03;&#x50CF;&#x9019;&#x6A23;&#xFF1A;&#x300C;&#x53EA;&#x5C08;&#x6CE8;&#x5728;&#x81EA;&#x5DF1;&#x548C;&#x76EE;&#x6A19;&#x4E0A;&#xFF0C;&#x4E0D;&#x505A;&#x5176;&#x4ED6;&#x6BD4;&#x8F03;&#x3002;&#x300D;</p>
<p>&#x4F3C;&#x4E4E;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x8A8D;&#x8B58;&#x9019;&#x6A23;&#x7684;&#x4EBA;&#xFF1F;&#x5176;&#x5BE6;&#x883B;&#x7FA8;&#x6155;&#x9019;&#x6A23;&#x7684;&#x6027;&#x683C;&#x7684;&#xFF0C;&#x5728; MTR &#x9019;&#x6BB5;&#x671F;&#x9593;&#xFF0C;&#x5F88;&#x591A;&#x6B21;&#x90FD;&#x5728;&#x601D;&#x8003;&#x81EA;&#x5DF1;&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x9EBC;&#x6A23;&#x7684;&#x500B;&#x6027;&#xFF0C;&#x7136;&#x5F8C;&#x9019;&#x4E9B;&#x500B;&#x6027;&#x5C0E;&#x81F4;&#x4E86;&#x81EA;&#x5DF1;&#x5E38;&#x72AF;&#x4E0B;&#x4EC0;&#x9EBC;&#x6A23;&#x7684;&#x554F;&#x984C;&#x3002;&#x4E00;&#x76F4;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x500B;&#x6027;&#x4E0A;&#x6709;&#x6240;&#x7F3A;&#x9677;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#x81EA;&#x5DF1;&#x5F88;&#x56AE;&#x5F80;&#x9019;&#x6A23;&#x7684;&#x6027;&#x683C;&#xFF0C;&#x7562;&#x7ADF;&#x81EA;&#x5DF1;&#x7684;&#x6027;&#x683C;&#x5C31;&#x662F;&#x5F88;&#x611B;&#x6BD4;&#x8F03;&#xFF0C;&#x7136;&#x5F8C;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x7E3D;&#x89BA;&#x5F97;&#x4E0D;&#x5920;&#x597D;&#x3002;&#x5728;&#x9019;&#x6B21;&#x7684;&#x8A08;&#x756B;&#x66F4;&#x89BA;&#x5F97;&#x9019;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x500B;&#x554F;&#x984C;&#xFF0C;&#x8FFD;&#x6C42;&#x597D;&#x4E0D;&#x662F;&#x554F;&#x984C;&#xFF0C;&#x4F46;&#x947D;&#x725B;&#x89D2;&#x5C16;&#x5C31;&#x662F;&#x4E86;&#x3002;&#x5DE5;&#x7A0B;&#x5E2B;&#x5728;&#x512A;&#x5316;&#x65B9;&#x9762;&#x6709;&#x4E00;&#x53E5;&#x8A71;&#x5F88;&#x6709;&#x540D;&#xFF1A;</p>
<blockquote>
<p>premature optimization is the root of all evil<br>&#x904E;&#x65E9;&#x6700;&#x4F73;&#x5316;&#x662F;&#x842C;&#x60E1;&#x7684;&#x6839;&#x6E90;</p>
</blockquote>
<p>&#x597D;&#x61C9;&#x8A72;&#x662F;&#x9010;&#x6B65;&#x8FFD;&#x6C42;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6BCF;&#x500B;&#x74B0;&#x7BC0;&#x90FD;&#x8981;&#x6C42;&#x5230;&#x6700;&#x597D;&#xFF0C;&#x53EA;&#x6703;&#x903C;&#x6B7B;&#x81EA;&#x5DF1;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x60F3;&#x8B8A;&#x6210;&#x90A3;&#x7A2E;&#x4F5B;&#x7CFB;&#x7684;&#x4EBA;&#x55CE;&#xFF1F;&#x6211;&#x4E5F;&#x4E0D;&#x592A;&#x78BA;&#x5B9A;&#xFF0C;&#x4F46;&#x662F;&#x8B93;&#x6211;&#x77E5;&#x9053;&#x8AAA;&#xFF1A;&#x300C;&#x5594;&#xFF0C;&#x539F;&#x4F86;&#x9084;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x9019;&#x6A23;&#x7684;&#x4E00;&#x7A2E;&#x5FC3;&#x614B;&#x300D;&#x5C0D;&#x6211;&#x800C;&#x8A00;&#x5C31;&#x662F;&#x500B;&#x6536;&#x7A6B;&#x4E86;&#xFF0C;&#x4E0D;&#x7528;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x90A3;&#x7A2E;&#x6C72;&#x6C72;&#x71DF;&#x71DF;&#x7684;&#x614B;&#x5EA6;&#x3002;</p>
<h3 id="&#x8A08;&#x756B;&#x7684;&#x6700;&#x5F8C;"><a href="#&#x8A08;&#x756B;&#x7684;&#x6700;&#x5F8C;" class="headerlink" title="&#x8A08;&#x756B;&#x7684;&#x6700;&#x5F8C;"></a>&#x8A08;&#x756B;&#x7684;&#x6700;&#x5F8C;</h3><p><img src="https://imgur.com/3pwnPWp.jpg"></p>
<p>&#x6574;&#x500B;&#x8A08;&#x756B;&#x771F;&#x7684;&#x904E;&#x5F97;&#x883B;&#x5FEB;&#x7684;&#xFF0C;&#x8AAA;&#x81EA;&#x5DF1;&#x5DF2;&#x7D93;&#x6210;&#x70BA;&#x5DE5;&#x7A0B;&#x5E2B;&#x55CE;&#xFF1F;&#x6C92;&#x6709;&#xFF0C;&#x7562;&#x7ADF;&#x9084;&#x6C92;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x904E;&#x5C31;&#x7B97;&#x771F;&#x7684;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#xFF0C;&#x77ED;&#x671F;&#x5167;&#x6211;&#x4E5F;&#x4E0D;&#x6562;&#x8AAA;&#x81EA;&#x5DF1;&#x662F;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x9084;&#x4E0D;&#x662F;&#x4E00;&#x500B;&#x6211;&#x81EA;&#x5DF1;&#x8A8D;&#x53EF;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x9019;&#x6B21;&#x8AB2;&#x7A0B;&#x4E4B;&#x5F8C;&#x4E86;&#x89E3;&#x5230;&#x81EA;&#x5DF1;&#x9084;&#x6B20;&#x7F3A;&#x592A;&#x591A;&#x3002;&#x800C;&#x4E14;&#x81EA;&#x5DF1;&#x4E5F;&#x4E0D;&#x592A;&#x559C;&#x6B61;&#x90A3;&#x7A2E;&#x807D;&#x8D77;&#x4F86;&#x5C31;&#x5F88;&#x53B2;&#x5BB3;&#x540D;&#x7A31;&#x3002;</p>
<p>&#x5927;&#x6982;&#x662F;&#x9019;&#x6A23;&#x5427;&#xFF0C;&#x7576;&#x7136;&#x65E2;&#x7136;&#x9019;&#x88E1;&#x63D0;&#x5230;&#x6536;&#x7A6B;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x63D0;&#x4E00;&#x4E9B;&#x6BD4;&#x8F03;&#x7B97;&#x662F;&#x512A;&#x9EDE;&#x7684;&#x6771;&#x897F;&#xFF0C;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x6216;&#x8005;&#x662F;&#x6539;&#x8B8A;&#x4EC0;&#x9EBC;&#x7684;&#x5C31;&#x6C92;&#x6709;&#x63D0;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x9019;&#x7BC7;&#x4E5F;&#x4E0D;&#x662F;&#x6574;&#x500B; MTR &#x7684;&#x5FC3;&#x5F97;&#x3002;MTR &#x7684;&#x5FC3;&#x5F97;&#x7684;&#x8A71;&#x61C9;&#x8A72;&#x4E4B;&#x5F8C;&#x518D;&#x6253;&#x4E00;&#x7BC7;&#xFF0C;&#x6211;&#x60F3;&#x6703;&#x662F;&#x5728;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#x4E4B;&#x5F8C;&#xFF0C;&#x7562;&#x7ADF;&#x81EA;&#x5DF1;&#x9084;&#x6709;&#x56DB;&#x500B;&#x6708;&#x7684;&#x5F79;&#x671F;&#x3002;</p>
<p>&#x7E3D;&#x4E4B;&#xFF0C;&#x4ECA;&#x5E74;&#x7E3D;&#x7B97;&#x5728;&#x6280;&#x80FD;&#x4E0A;&#x81EA;&#x5DF1;&#x89BA;&#x5F97;&#x6709;&#x4E00;&#x9EDE;&#x4FE1;&#x5FC3;&#x4E86;&#xFF0C;&#x660E;&#x5E74;&#x5C31;&#x662F;&#x9A57;&#x8B49;&#x4ECA;&#x5E74;&#x5B78;&#x7FD2;&#x6210;&#x679C;&#x7684;&#x4E00;&#x5E74;&#x4E86;&#x3002;</p>
<h2 id="&#x6C7D;&#x8ECA;&#x99D5;&#x7167;"><a href="#&#x6C7D;&#x8ECA;&#x99D5;&#x7167;" class="headerlink" title="&#x6C7D;&#x8ECA;&#x99D5;&#x7167;"></a>&#x6C7D;&#x8ECA;&#x99D5;&#x7167;</h2><p>&#x662F;&#x7684;&#xFF0C;&#x7D42;&#x65BC;&#x8003;&#x5230;&#x6C7D;&#x8ECA;&#x99D5;&#x7167;&#x4E86;&#xFF0C;&#x96D6;&#x7136;&#x56E0;&#x70BA;&#x4E0A;&#x5761;&#x8D77;&#x6B65;&#x91CD;&#x8003;&#x4E86;&#x4E00;&#x6B21;&#x3002;&#x4E00;&#x76F4;&#x89BA;&#x5F97;&#x8003;&#x5230;&#x6C7D;&#x8ECA;&#x99D5;&#x7167;&#x5C31;&#x50CF;&#x7375;&#x4EBA;&#x57F7;&#x7167;&#xFF0C;&#x62FF;&#x5230;&#x4E4B;&#x5F8C;&#x6709;&#x4E00;&#x7A2E;&#x771F;&#x7684;&#x6B65;&#x5165;&#x793E;&#x6703;&#x7684;&#x611F;&#x89BA;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x505A;&#x4EC0;&#x9EBC;&#x90FD;&#x65B9;&#x4FBF;&#x5F88;&#x591A;&#xFF0C;&#x50CF;&#x662F;&#x642C;&#x5BB6;&#x4E4B;&#x985E;&#x7684;&#x3002;&#x5C0D;&#x6211;&#x9019;&#x7A2E;&#x63D0;&#x4E0D;&#x8D77;&#x9762;&#x5B50;&#x53BB;&#x6C42;&#x4EBA;&#x7684;&#x500B;&#x6027;&#x771F;&#x7684;&#x662F;&#x5FC5;&#x9700;&#x54C1;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x958B;&#x8ECA;&#x4E4B;&#x5F8C;&#x5C31;&#x6703;&#x958B;&#x59CB;&#x5728;&#x610F;&#x8ECA;&#x5B50;&#x7684;&#x54C1;&#x724C;&#x9084;&#x6709;&#x8ECA;&#x5B50;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x958B;&#x59CB;&#x60F3;&#x8981;&#x8CB7;&#x8ECA;&#x7684;&#x5FF5;&#x982D;&#x3002;&#x592A;&#x53EF;&#x6015;&#x4E86;&#xFF0C;&#x4E0D;&#x904E;&#x4E4B;&#x5F8C;&#x5728;&#x53F0;&#x5317;&#x9084;&#x662F;&#x5225;&#x60F3;&#x4E86;&#x3002;&#x81EA;&#x5DF1;&#x7684;&#x5922;&#x60F3;&#x61C9;&#x8A72;&#x662F;&#x958B;&#x8457;&#x5C0F;&#x76AE;&#x5361;&#x8F09;&#x8457;&#x8D8A;&#x91CE;&#x8ECA;&#x53BB;&#x9A0E; Enduro &#x5427;&#x3002;&#x5728;&#x6C92;&#x4EBA;&#x7684;&#x8352;&#x90CA;&#x91CE;&#x5916;&#x628A;&#x8ECA;&#x653E;&#x4E0B;&#x4F86;&#x4E4B;&#x5F8C;&#x958B;&#x59CB;&#x72C2;&#x98C6;&#xFF0C;&#x7136;&#x5F8C;&#x9A0E;&#x5230;&#x7D2F;&#x518D;&#x5C31;&#x642D;&#x5E33;&#x7BF7;&#x4F11;&#x606F;&#xFF0C;&#x5149;&#x60F3;&#x5C31;&#x5F88;&#x723D;&#x3002;</p>
<h2 id="&#x7576;&#x5175;"><a href="#&#x7576;&#x5175;" class="headerlink" title="&#x7576;&#x5175;"></a>&#x7576;&#x5175;</h2><p>&#x5176;&#x5BE6;&#x9084;&#x6C92;&#x7576;&#x5175;&#x5566;&#xFF0C;&#x5165;&#x4F0D;&#x662F; 2021 &#x5E74;&#x521D;&#x3002;&#x5728;&#x6C92;&#x6709;&#x7576;&#x5175;&#x4E4B;&#x524D;&#xFF0C;&#x4E5F;&#x4E0D;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x771F;&#x6B63;&#x8E0F;&#x5165;&#x4E86;&#x793E;&#x6703;&#xFF0C;&#x7B49;&#x771F;&#x6B63;&#x7576;&#x5B8C;&#x5175;&#x624D;&#x6709;&#x4E00;&#x7A2E;&#x81EA;&#x7531;&#x7684;&#x611F;&#x89BA;&#xFF0C;&#x4E0D;&#x904E;&#x9019;&#x4E5F;&#x662F;&#x5927;&#x90E8;&#x5206;&#x7537;&#x6027;&#x90FD;&#x8981;&#x7D93;&#x6B77;&#x904E;&#x5F97;&#x4E00;&#x6BB5;&#x6642;&#x671F;&#x3002;&#x4F46;&#x5176;&#x5BE6;&#x6211;&#x5C0D;&#x7576;&#x5175;&#x9084;&#x883B;&#x53CD;&#x611F;&#x7684;&#xFF0C;&#x89BA;&#x5F97;&#x9019;&#x6BB5;&#x6642;&#x9593;&#x53EF;&#x4EE5;&#x66F4;&#x6709;&#x610F;&#x7FA9;&#xFF0C;&#x7576;&#x521D;&#x70BA;&#x4E86;&#x62FC;&#x770B;&#x770B;&#x514D;&#x5F79;&#x9084;&#x53BB;&#x91AB;&#x9662;&#x81EA;&#x8CBB;&#x8907;&#x6AA2;&#x3002;&#x800C;&#x4E14;&#x6211;&#x81EA;&#x5DF1;&#x5C31;&#x5DF2;&#x7D93;&#x6BD4;&#x5225;&#x4EBA;&#x9084;&#x8981;&#x665A;&#x9032;&#x5165;&#x8077;&#x5834;&#xFF0C;&#x60F3;&#x8981;&#x9084;&#x8981;&#x82B1;&#x9019;&#x56DB;&#x500B;&#x6708;&#x5C31;&#x89BA;&#x5F97;&#x5F88;&#x6C92;&#x5FC5;&#x8981;&#x3002;</p>
<p>&#x4E0D;&#x904E;&#x8A72;&#x4F86;&#x7684;&#x9084;&#x662F;&#x8981;&#x4F86;&#xFF0C;&#x8EB2;&#x4E0D;&#x6389;&#x3002;&#x4E0D;&#x904E;&#x883B;&#x5E78;&#x904B;&#x7684;&#x662F;&#x81EA;&#x5DF1;&#x5728;&#x6574;&#x500B; MTR &#x7D50;&#x675F;&#x4E4B;&#x5F8C;&#x624D;&#x5165;&#x4F0D;&#xFF0C;&#x4E5F;&#x8B93;&#x6211;&#x5728;&#x627E;&#x5DE5;&#x4F5C;&#x4E4B;&#x524D;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#x518D;&#x9032;&#x4FEE;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x5920;&#x6709;&#x500B;&#x6642;&#x9593;&#x53EF;&#x4EE5;&#x6C88;&#x6FB1;&#x4E00;&#x4E0B;&#x4E5F;&#x4E0D;&#x932F;&#x3002;&#x4E0D;&#x904E;&#x5F88;&#x6015;&#x9019;&#x5E7E;&#x500B;&#x6708;&#x4E0A;&#x7684;&#x6771;&#x897F;&#x9000;&#x4F0D;&#x4E4B;&#x5F8C;&#x5168;&#x90E8;&#x5FD8;&#x5149;&#x5149;&#x554A;&#x2026;</p>
<h2 id="&#x651D;&#x5F71;"><a href="#&#x651D;&#x5F71;" class="headerlink" title="&#x651D;&#x5F71;"></a>&#x651D;&#x5F71;</h2><p><img src="https://imgur.com/SGY0ZY4.jpg"></p>
<p>&#x81EA;&#x5DF1;&#x4ECA;&#x5E74;&#x6709;&#x5728;&#x5617;&#x8A66;&#x958B;&#x59CB;&#x651D;&#x5F71;&#xFF0C;&#x7136;&#x5F8C;&#x4E1F;&#x4E0A; IG&#x3002;&#x4E0D;&#x904E;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x4E0A;&#x534A;&#x5E74;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x4E0B;&#x534A;&#x5E74;&#x56DE;&#x5230;&#x5B9C;&#x862D;&#x5C31;&#x6C92;&#x6709;&#x4E86;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x70BA;&#x767C;&#x73FE;&#x8AAA;&#x81EA;&#x5DF1;&#x4E4B;&#x524D;&#x7684; GH4 &#x4E00;&#x76F4;&#x6C92;&#x6709;&#x5728;&#x7528;&#xFF08;&#x4E4B;&#x524D;&#x8CB7; GH4 &#x4E3B;&#x8981;&#x5C31;&#x662F;&#x70BA;&#x4E86;&#x62CD;&#x651D;&#x5F71;&#x7247;&#xFF09;&#xFF0C;&#x5F8C;&#x4F86;&#x5C31;&#x628A; GH4 &#x8CE3;&#x6389;&#xFF0C;&#x4E0D;&#x904E;&#x81EA;&#x5DF1;&#x9084;&#x662F;&#x6709;&#x6703;&#x60F3;&#x8981;&#x62CD;&#x7167;&#x7684;&#x6642;&#x5019;&#x3002;&#x9019;&#x6642;&#x5019;&#x70BA;&#x4E86;&#x8AAA;&#x81EA;&#x5DF1;&#x8981;&#x8CB7;&#x54EA;&#x4E00;&#x53F0;&#x76F8;&#x6A5F;&#x5176;&#x5BE6;&#x60F3;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x5F8C;&#x4F86;&#x8CB7;&#x4E86; GRII&#x3002;</p>
<p>GR &#x771F;&#x7684;&#x662F;&#x4E00;&#x53F0;&#x6703;&#x8B93;&#x4F60;&#x5F88;&#x60F3;&#x5E36;&#x51FA;&#x53BB;&#x7684;&#x76F8;&#x6A5F;&#xFF0C;&#x800C;&#x4E14;&#x5E36;&#x8457;&#x7684;&#x611F;&#x89BA;&#x5F88;&#x81EA;&#x5728;&#xFF0C;&#x4E0D;&#x6703;&#x6709;&#x9077;&#x5C31;&#x76F8;&#x6A5F;&#x7684;&#x611F;&#x89BA;&#xFF0C;&#x4E4B;&#x524D;&#x7684; GH4 &#x5E36;&#x8D77;&#x4F86;&#x5C31;&#x6709;&#x9EDE;&#x91CD;&#xFF0C;&#x9084;&#x6709;&#x5E36;&#x4E00;&#x500B;&#x76F8;&#x6A5F;&#x5305;&#x51FA;&#x9580;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x7D2F;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>GR &#x4E5F;&#x4E0D;&#x6703;&#x6709;&#x5BB3;&#x6015;&#x5176;&#x4ED6;&#x4EBA;&#x773C;&#x5149;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x81EA;&#x5DF1;&#x81C9;&#x76AE;&#x883B;&#x8584;&#x7684;&#xFF0C;&#x4E0D;&#x592A;&#x559C;&#x6B61;&#x90A3;&#x7A2E;&#x88AB;&#x4EBA;&#x6CE8;&#x76EE;&#x7684;&#x611F;&#x89BA;&#xFF0C;&#x5E36;&#x8457;&#x4E00;&#x53F0;&#x76F8;&#x6A5F;&#x5728;&#x8DEF;&#x4E0A;&#x611F;&#x89BA;&#x5F88;&#x62DB;&#x6416;&#xFF0C;GR &#x62FF;&#x5728;&#x624B;&#x4E0A;&#x5C31;&#x81EA;&#x5728;&#x8A31;&#x591A;&#x3002;</p>
<p>&#x4E5F;&#x662F;&#x56E0;&#x70BA; GR &#x8B93;&#x6211;&#x60F3;&#x8A66;&#x8457;&#x958B;&#x59CB;&#x8A8D;&#x771F;&#x4E00;&#x9EDE;&#x62CD;&#x7167;&#x770B;&#x770B;&#xFF0C;&#x4E5F;&#x958B;&#x59CB;&#x89BA;&#x5F97;&#x651D;&#x5F71;&#x662F;&#x4EF6;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8CB7;&#x4E86;&#x5E7E;&#x672C;&#x66F8;&#x60F3;&#x66F4;&#x6DF1;&#x7684;&#x4E86;&#x89E3;&#x6709;&#x95DC;&#x651D;&#x5F71;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E5F;&#x958B;&#x4E86;&#x5E33;&#x865F;&#x628A;&#x81EA;&#x5DF1;&#x4F5C;&#x54C1;&#x4E1F;&#x4E0A;&#x53BB;&#x8A66;&#x770B;&#x770B;&#x3002;</p>
<p>&#x4E0D;&#x904E;&#x56DE;&#x4F86;&#x5B9C;&#x862D;&#x4E4B;&#x5F8C;&#x5C31;&#x6C92;&#x6709;&#x7E7C;&#x7E8C;&#x4E86;&#xFF0C;&#x883B;&#x5999;&#x7684;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x70BA;&#x4EC0;&#x9EBC;&#xFF0C;&#x5C31;&#x662F;&#x6C92;&#x6709;&#x90A3;&#x7A2E;&#x60F3;&#x8981;&#x63A2;&#x7D22;&#x7684;&#x5FC3;&#x60C5;&#xFF0C;&#x53EF;&#x80FD;&#x8DDF;&#x6DE1;&#x6C34;&#x6BD4;&#x8F03;&#x6709;&#x611F;&#x60C5;&#x5427;&#x3002;&#x81EA;&#x5DF1;&#x5F85;&#x4E86;&#x516D;&#x5E74;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x4E00;&#x500B;&#x81EA;&#x5DF1;&#x771F;&#x6B63;&#x5F9E;&#x964C;&#x751F;&#x5230;&#x719F;&#x6089;&#xFF0C;&#x7136;&#x5F8C;&#x81EA;&#x5DF1;&#x4E5F;&#x5728;&#x9019;&#x88E1;&#x6210;&#x9577;&#x73FE;&#x5728;&#x7684;&#x6A21;&#x6A23;&#xFF0C;&#x5C0D;&#x6DE1;&#x6C34;&#x6709;&#x7A2E;&#x5F88;&#x4E0D;&#x4E00;&#x6A23;&#x7684;&#x611F;&#x60C5;&#x3002;</p>
<p><img src="https://imgur.com/1ZfubJb.jpg"></p>
<p>&#x4E4B;&#x5F8C;&#x5230;&#x53F0;&#x5317;&#x5DE5;&#x4F5C;&#x61C9;&#x8A72;&#x6703;&#x7E7C;&#x7E8C;&#x651D;&#x5F71;&#xFF0C;&#x4E0D;&#x904E;&#x984C;&#x6750;&#x5C31;&#x4E0D;&#x4E00;&#x5B9A;&#x4E86;&#x3002;&#x76EE;&#x524D;&#x883B;&#x559C;&#x6B61;&#x8857;&#x62CD;&#x7684;&#x611F;&#x89BA;&#xFF0C;&#x559C;&#x6B61;&#x5F9E;&#x4E0D;&#x8D77;&#x773C;&#x7684;&#x4E8B;&#x7269;&#x627E;&#x51FA;&#x8B93;&#x81EA;&#x5DF1;&#x70BA;&#x4E4B;&#x4E00;&#x4EAE;&#x7684;&#x756B;&#x9762;&#xFF0C;&#x800C;&#x4E14;&#x7B97;&#x883B;&#x7B26;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x500B;&#x6027;&#x3002;&#x651D;&#x5F71;&#x53EF;&#x80FD;&#x4E0D;&#x6703;&#x662F;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x6703;&#x4E0D;&#x6703;&#x8B8A;&#x6210;&#x6211;&#x4EBA;&#x751F;&#x4E2D;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x53CD;&#x6B63;&#x89BA;&#x5F97;&#x6709;&#x8DA3;&#xFF0C;&#x5C31;&#x7E7C;&#x7E8C;&#x4E0B;&#x53BB;&#x5427;&#x3002;</p>
<h2 id="Podcast"><a href="#Podcast" class="headerlink" title="Podcast"></a>Podcast</h2><p>&#x9019;&#x9EDE;&#x662F;&#x7A81;&#x7136;&#x60F3;&#x5230;&#x7684;&#xFF0C;&#x81EA;&#x5DF1;&#x597D;&#x50CF;&#x4ECA;&#x5E74;&#x958B;&#x59CB;&#x807D; Podcast &#x4E86;&#xFF01;&#xFF01;&#x5176;&#x5BE6;&#x53BB;&#x5E74;&#x5C31;&#x6709;&#x958B;&#x59CB;&#x807D;&#x4E86;&#x5566;&#xFF0C;&#x4E0D;&#x904E;&#x53BB;&#x5E74;&#x6839;&#x672C;&#x6C92;&#x6709;&#x505A;&#x56DE;&#x9867;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x7576;&#x4F5C;&#x4ECA;&#x5E74;&#x5427;&#x3002;&#x4E00;&#x958B;&#x59CB;&#x958B;&#x59CB;&#x807D;&#x5F97;&#x5951;&#x6A5F;&#x662F;&#x56E0;&#x70BA;&#x958B;&#x59CB;&#x5BE6;&#x7FD2;&#xFF0C;&#x7576;&#x6642;&#x9084;&#x5728;&#x4F4F;&#x6DE1;&#x6C34;&#x7684;&#x6211;&#x8981;&#x5230;&#x5584;&#x5C0E;&#x5BFA;&#x53BB;&#x5BE6;&#x7FD2;&#xFF0C;&#x5927;&#x6982; 50 &#x5206;&#x9418;&#x7684;&#x8DEF;&#x7A0B;&#xFF08;&#x5305;&#x542B;&#x5230;&#x6377;&#x904B;&#x7AD9;&#x9084;&#x6709;&#x8D70;&#x5230;&#x516C;&#x53F8;&#xFF09;&#x5982;&#x679C;&#x6C92;&#x6709;&#x4E00;&#x9EDE;&#x6D88;&#x9063;&#x771F;&#x662F;&#x592A;&#x75DB;&#x82E6;&#x4E86;&#x3002;</p>
<p>&#x8B1B;&#x5230;&#x6377;&#x904B;&#x4E0A;&#x9762;&#x7684;&#x6D88;&#x9063;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x901A;&#x5E38;&#x662F;&#x770B;&#x6F2B;&#x756B;&#x3002;&#x53EF;&#x662F;&#x770B;&#x6F2B;&#x756B;&#x5982;&#x679C;&#x770B;&#x5230;&#x5C3A;&#x5EA6;&#x6BD4;&#x8F03;&#x5927;&#x7684;&#x756B;&#x9762;&#xFF08;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x9650;&#x5236;&#x7D1A;&#xFF0C;&#x800C;&#x4E14;&#x4F60;&#x81EA;&#x5DF1;&#x4E5F;&#x6C92;&#x6709;&#x9810;&#x671F;&#x6703;&#x51FA;&#x73FE;&#x7684;&#x90A3;&#x7A2E;&#xFF09;&#x6642;&#x65C1;&#x908A;&#x5F88;&#x591A;&#x4EBA;&#x5C31;&#x6574;&#x500B;&#x5F88;&#x5C2C;&#xFF0C;&#x5C2C;&#x5230;&#x7206;&#x3002;&#x4F46;&#x662F;&#x6211;&#x53C8;&#x4E0D;&#x5728;&#x6377;&#x904B;&#x4E0A;&#x770B;&#x5F71;&#x7247;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x559C;&#x597D;&#x4E00;&#x89BD;&#x7121;&#x907A;&#xFF0C;&#x7136;&#x5F8C;&#x81EA;&#x5DF1;&#x7684;&#x53CD;&#x61C9;&#x53C8;&#x8D64;&#x88F8;&#x7684;&#x653E;&#x5728;&#x5927;&#x773E;&#x9762;&#x524D;&#xFF0C;&#x9019;&#x771F;&#x7684;&#x8D85;&#x6065;&#x7684;&#x3002;&#x9084;&#x6709;&#x4E5F;&#x6709;&#x8A66;&#x904E;&#x770B;&#x6587;&#x7AE0;&#xFF0C;&#x4E0D;&#x904E;&#x2026;&#x5728;&#x8ECA;&#x4E0A;&#x7684;&#x610F;&#x5FD7;&#x529B;&#x771F;&#x7684;&#x5F88;&#x4F4E;&#x554A;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x56DE;&#x5BB6;&#x7684;&#x6642;&#x5019;&#x3002;</p>
<p>Podcast &#x5C31;&#x4E0D;&#x932F;&#xFF0C;&#x96B1;&#x79C1;&#x6027;&#x4E0A;&#x56E0;&#x70BA;&#x662F;&#x7528;&#x8033;&#x6735;&#x807D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D;&#x6703;&#x88AB;&#x5225;&#x4EBA;&#x807D;&#x5230;&#x4EC0;&#x9EBC;&#xFF0C;&#x96D6;&#x7136;&#x81EA;&#x5DF1;&#x7684;&#x53CD;&#x61C9;&#x4E5F;&#x662F;&#x5F88;&#x8D64;&#x88F8;&#x5566;&#xFF0C;&#x4E0D;&#x904E;&#x81F3;&#x5C11;&#x5225;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x807D;&#x4EC0;&#x9EBC;&#x3002;&#x800C;&#x4E14;&#x4E5F;&#x6BD4;&#x6F2B;&#x756B;&#x9084;&#x6709;&#x610F;&#x7FA9;&#x5F88;&#x591A;&#x963F;&#xFF0C;&#x81EA;&#x5DF1;&#x7B97;&#x6709;&#x807D;&#x7684;&#x5E7E;&#x500B;&#x983B;&#x9053;&#x662F;&#xFF1A;<a target="_blank" rel="noopener" href="https://drinkwithmario.thenewslens.com/">&#x99AC;&#x529B;&#x6B50;&#x966A;&#x4F60;&#x559D;&#x4E00;&#x676F;</a>&#x3001;<a target="_blank" rel="noopener" href="https://blog.justfont.com/category/%E5%AD%97%E5%9E%8B%E8%85%A6%E8%A3%9C/">&#x5B57;&#x578B;&#x8166;&#x88DC;</a>&#x3001;<a target="_blank" rel="noopener" href="https://www.youtube.com/channel/UCzFfSrF6-v3Ey5i95w48noQ">&#x9802;&#x6A13;&#x52A0;&#x84CB;</a>&#x3002;&#x50CF;&#x99AC;&#x529B;&#x6B50;&#x81EA;&#x5DF1;&#x5C31;&#x883B;&#x559C;&#x6B61;&#x6311;&#x5E7E;&#x500B;&#x81EA;&#x5DF1;&#x597D;&#x5947;&#x7684;&#x4F86;&#x8CD3;&#x4F86;&#x807D;&#xFF0C;&#x50CF;&#x5206;&#x4EAB;&#x5404;&#x7A2E;&#x4E0D;&#x540C;&#x8077;&#x696D;&#x7684;&#x7684;&#x4E00;&#x4E9B;&#x5FC3;&#x8DEF;&#x6B77;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x591A;&#x90FD;&#x662F;&#x9818;&#x57DF;&#x4E2D;&#x883B;&#x8CC7;&#x6DF1;&#x7684;&#x524D;&#x8F29;&#xFF0C;&#x807D;&#x4E0B;&#x4F86;&#x4E5F;&#x662F;&#x4E86;&#x89E3;&#x883B;&#x591A;&#x6771;&#x897F;&#x7684;&#x3002;</p>
<p><img src alt="&#x99AC;&#x529B;&#x6B50;&#x966A;&#x4F60;&#x559D;&#x4E00;&#x676F;"></p>
<p>&#x5B57;&#x578B;&#x8166;&#x88DC;&#x5C31;&#x4E0D;&#x63D0;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x9019;&#x500B;&#x6BD4;&#x8F03;&#x504F;&#x81EA;&#x5DF1;&#x5F97;&#x8208;&#x8DA3;&#x5427;&#xFF0C;&#x8A2D;&#x8A08;&#x76F8;&#x95DC;&#x7684;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x770B;&#x770B;&#xFF0C;&#x4E0D;&#x904E;&#x5167;&#x5BB9;&#x7B97;&#x662F;&#x6BD4;&#x5165;&#x9580;&#x518D;&#x66F4;&#x6DF1;&#x4E00;&#x4E9B;&#x3002;&#x9802;&#x6A13;&#x52A0;&#x84CB;&#x6700;&#x8FD1;&#x624D;&#x958B;&#x59CB;&#x807D;&#xFF0C;&#x56E0;&#x70BA;&#x4E5F;&#x662F;&#x8EDF;&#x9AD4;&#x958B;&#x767C;&#x9818;&#x57DF;&#x548C;&#x5275;&#x696D;&#x7684; Podcast&#xFF0C;&#x800C;&#x4E14; MTR &#x8A08;&#x756B;&#x7684;&#x52A9;&#x6559;&#x63A8;&#x85A6;&#xFF0C;&#x6574;&#x500B; Podcast &#x90FD;&#x53EF;&#x4EE5;&#x807D;&#x5230;&#x6FC3;&#x6FC3;&#x7684;&#x5E79;&#x8A71;&#xFF0C;&#x5F88;&#x50CF;&#x81EA;&#x5DF1;&#x5728;&#x670B;&#x53CB;&#x804A;&#x5929;&#x4E00;&#x6A23;&#xFF0C;&#x3002;</p>
<p>&#x5176;&#x5BE6;&#x73FE;&#x5728;&#x6211;&#x4E5F;&#x4E0D;&#x662F;&#x6BCF;&#x9031;&#x90FD;&#x6703;&#x56FA;&#x5B9A;&#x807D;&#x7684;&#x90A3;&#x7A2E;&#xFF0C;&#x7562;&#x7ADF;&#x73FE;&#x5728;&#x4E5F;&#x6C92;&#x6709;&#x5728;&#x5BE6;&#x7FD2;&#xFF0C;&#x800C;&#x4E14;&#x76EE;&#x524D;&#x7684;&#x901A;&#x52E4;&#x671F;&#x9593;&#x4E5F;&#x4E0D;&#x9069;&#x5408;&#x807D; Podcast&#xFF08;&#x9A0E;&#x8ECA;&#x6642;&#x8ACB;&#x4E0D;&#x8981;&#x6234;&#x8033;&#x6A5F;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x901A;&#x52E4;&#x6216;&#x8005;&#x662F;&#x505A;&#x4E00;&#x4E9B;&#x6BD4;&#x8F03;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x601D;&#x8003;&#x4E8B;&#x60C5;&#x6642;&#x807D; Podcast &#x771F;&#x7684;&#x8D85;&#x68D2;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x6D88;&#x9063;&#x6642;&#x9593;&#x65B9;&#x5F0F;&#x7B97;&#x6BD4;&#x8F03;&#x4E0D;&#x6703;&#x90A3;&#x9EBC;&#x7D2F;&#xFF0C;&#x800C;&#x4E14;&#x53C8;&#x9084;&#x7B97;&#x6709;&#x610F;&#x7FA9;&#x3002;&#x6574;&#x9AD4;&#x4E0B;&#x4F86;&#x7B97;&#x662F;&#x883B;&#x63A8;&#x85A6;&#x7684;&#xFF0C;&#x4E0D;&#x904E;&#x771F;&#x7684;&#x9700;&#x8981;&#x5C08;&#x5FC3;&#x5F97;&#x6642;&#x5019;&#x9084;&#x662F;&#x62D4;&#x6389;&#x8033;&#x6A5F;&#x597D;&#x597D;&#x8655;&#x7406;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x3002;</p>
<h2 id="2020-&#x600E;&#x9EBC;&#x6A23;&#xFF1F;&#x9084;&#x6709;-2021-&#x5462;&#xFF1F;"><a href="#2020-&#x600E;&#x9EBC;&#x6A23;&#xFF1F;&#x9084;&#x6709;-2021-&#x5462;&#xFF1F;" class="headerlink" title="2020 &#x600E;&#x9EBC;&#x6A23;&#xFF1F;&#x9084;&#x6709; 2021 &#x5462;&#xFF1F;"></a>2020 &#x600E;&#x9EBC;&#x6A23;&#xFF1F;&#x9084;&#x6709; 2021 &#x5462;&#xFF1F;</h2><p>&#x76EE;&#x524D;&#x6BD4;&#x8F03;&#x60F3;&#x5F97;&#x5230;&#x7684;&#x5C31;&#x9019;&#x5E7E;&#x9EDE;&#xFF0C;&#x4F46;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x662F;&#x4E00;&#x500B;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#x60F3;&#x8D77;&#x4E8B;&#x60C5;&#x7684;&#x4EBA;&#xFF0C;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x81EA;&#x5DF1;&#x4E5F;&#x6C92;&#x6709;&#x5FD8;&#x8A18;&#xFF0C;&#x4F46;&#x5C31;&#x662F;&#x60F3;&#x4E0D;&#x8D77;&#x4F86;&#xFF0C;&#x5C31;&#x6703;&#x9700;&#x8981;&#x4E00;&#x500B;&#x9EDE;&#x53BB;&#x5E6B;&#x6211;&#x52FE;&#x8D77;&#x90A3;&#x500B;&#x56DE;&#x61B6;&#x3002;&#x60F3;&#x4E0D;&#x8D77;&#x4F86;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x55CE;&#xFF1F;&#x4E0D;&#x5C0D;&#xFF0C;&#x5F88;&#x591A;&#x90FD;&#x662F;&#x8D85;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x4E0D;&#x8D77;&#x4F86;&#x4E5F;&#x6C92;&#x8FA6;&#x6CD5;&#x963F;&#xFF0C;&#x5C31;&#x7B97;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x6703;&#x60F3;&#x5728;&#x9019;&#x500B;&#x6642;&#x9593;&#x5BEB;&#x9019;&#x6A23;&#x7684;&#x4E00;&#x7BC7;&#xFF0C;&#x4E5F;&#x662F;&#x56E0;&#x70BA;&#x9019;&#x5E74;&#x5C0D;&#x6211;&#x800C;&#x8A00;&#x5F88;&#x4E0D;&#x4E00;&#x6A23;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x812B;&#x96E2;&#x4E86;&#x5B78;&#x6821;&#xFF0C;&#x9032;&#x5165;&#x4E86;&#x4EBA;&#x751F;&#x7684;&#x53E6;&#x4E00;&#x500B;&#x968E;&#x6BB5;&#x3002;&#x5728;&#x5927;&#x5B78;&#x6642;&#x671F;&#x6709;&#x5F88;&#x591A;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x60F3;&#x505A;&#x7684;&#x7919;&#x65BC;&#x81EA;&#x5DF1;&#x662F;&#x5B78;&#x751F;&#xFF0C;&#x7D93;&#x6FDF;&#x7B49;&#x56E0;&#x70BA;&#x6C92;&#x8FA6;&#x6CD5;&#x5B8C;&#x6210;&#x3002;&#x9019;&#x662F;&#x5BE6;&#x73FE;&#x81EA;&#x5DF1;&#x4EBA;&#x751F;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x55CE;&#xFF1F;&#x4E0D;&#x592A;&#x559C;&#x6B61;&#x9019;&#x7A2E;&#x5F88;&#x76F4;&#x92B7;&#x7684;&#x8AAA;&#x6CD5;&#xFF0C;&#x4F46;&#x7684;&#x78BA;&#x662F;&#x500B;&#x958B;&#x59CB;&#x6C92;&#x932F;&#xFF0C;&#x800C;&#x4E14;&#x7AD9;&#x4E0A;&#x9019;&#x500B;&#x8D77;&#x9EDE;&#x4E5F;&#x8B93;&#x81EA;&#x5DF1;&#x89BA;&#x5F97;&#x883B;&#x8208;&#x596E;&#x7684;&#x3002;</p>
<p>&#x4E0D;&#x904E;&#x4E5F;&#x53EA;&#x662F;&#x8D77;&#x9EDE;&#x800C;&#x5DF2;&#xFF0C;&#x81EA;&#x5DF1;&#x5F88;&#x5E38;&#x72AF;&#x7684;&#x554F;&#x984C;&#x5C31;&#x662F;&#x6A02;&#x6975;&#x751F;&#x60B2;&#x4E86;&#xFF0C;&#x60F3;&#x7684;&#x5F88;&#x591A;&#x7D50;&#x679C;&#x53EA;&#x60F3;&#x7576;&#x500B; coach potato &#x9019;&#x624D;&#x662F;&#x4E00;&#x76F4;&#x4EE5;&#x4F86;&#x7684;&#x72C0;&#x614B;&#x3002;</p>
<p>&#x90A3; 2021 &#x5E74;&#x5462;&#xFF1F;&#x5C31;&#x50CF;&#x525B;&#x525B;&#x8B1B;&#x7684; 2021 &#x6703;&#x662F;&#x883B;&#x4E0D;&#x4E00;&#x6A23;&#x7684;&#x4E00;&#x5E74;&#x3002;</p>
<p>&#x982D;&#x56DB;&#x500B;&#x6708;&#xFF0C;&#x81EA;&#x5DF1;&#x6703;&#x5728;&#x91D1;&#x516D;&#x7D50;&#x5EA6;&#x904E;&#x3002;1/7 &#x865F;&#x5165;&#x4F0D;&#xFF0C;&#x9810;&#x8A08; 4/16 &#x9000;&#x4F0D;&#x5427;&#x3002;&#x76EE;&#x524D;&#x9810;&#x8A08;&#x8AAA;&#x9019;&#x6BB5;&#x6642;&#x9593;&#x6162;&#x6162;&#x8907;&#x7FD2;&#x9762;&#x662F;&#x7684;&#x5167;&#x5BB9;&#xFF0C;&#x767C;&#x73FE;&#x9084;&#x6709;&#x633A;&#x591A;&#x6771;&#x897F;&#x9700;&#x8981;&#x6E96;&#x5099;&#x7684;&#xFF0C;&#x50CF;&#x5C65;&#x6B77;&#x4E4B;&#x985E;&#x7684;&#x6771;&#x897F;&#x3002;</p>
<p>&#x9000;&#x4F0D;&#x4E4B;&#x5F8C;&#x6703;&#x958B;&#x59CB;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x76EE;&#x524D;&#x770B;&#x4E0B;&#x4F86;&#x9019;&#x500B;&#x904E;&#x7A0B;&#x53EF;&#x9577;&#x53EF;&#x77ED;&#xFF0C;&#x77ED;&#x5247;&#x5169;&#x9031;&#xFF08;&#x771F;&#x7684;&#x6703;&#x9019;&#x9EBC;&#x77ED;&#x2026;&#x55CE;&#xFF1F;&#xFF09;&#xFF0C;&#x9577;&#x5247;&#x5169;&#x500B;&#x6708;&#x5427;&#xFF1F;&#x7B49;&#x7B49;&#xFF0C;&#x9019;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x7D66;&#x6211;&#x7684;&#x4E00;&#x500B; deadline &#x55CE;&#xFF1F;&#x5982;&#x679C;&#x771F;&#x7684;&#x62D6;&#x5230;&#x5169;&#x500B;&#x6708;&#x7684;&#x8A71;&#xFF0C;&#x53EF;&#x80FD;&#x6703;&#x8DDF;&#x7562;&#x696D;&#x751F;&#x4E00;&#x8D77;&#x7AF6;&#x722D;&#x5DE5;&#x4F5C;&#xFF0C;&#x9019;&#x5230;&#x5E95;&#x7B97;&#x662F;&#x597D;&#x9084;&#x662F;&#x4E0D;&#x597D;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x662F;&#x5F88;&#x6311;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x500B;&#x4EBA;&#x6B38;&#xFF0C;&#x524D;&#x9762;&#x597D;&#x50CF;&#x6C92;&#x6709;&#x63D0;&#x5230;&#xFF0C;&#x56DE;&#x5B9C;&#x862D;&#x4E4B;&#x5F8C;&#x5C31;&#x63DB;&#x4E86;&#x5927;&#x6982; 4, 5 &#x500B;&#x5DE5;&#x4F5C;&#x5427;&#xFF0C;&#x4E0D;&#x904E;&#x90FD;&#x662F;&#x6253;&#x5DE5;&#xFF0C;&#x800C;&#x4E14;&#x524D;&#x9762;&#x5E7E;&#x500B;&#x96E2;&#x8077;&#x7684;&#x90FD;&#x662F;&#x9910;&#x98F2;&#x696D;&#xFF08;&#x6211;&#x771F;&#x7684;&#x8981;&#x5728;&#x9019;&#x88E1;&#x91CD;&#x7533;&#xFF0C;&#x7D55;&#x5C0D;&#x4E0D;&#x6703;&#x518D;&#x53BB;&#x9910;&#x98F2;&#x696D;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x525B;&#x56DE;&#x4F86;&#x7684;&#x6642;&#x5019;&#x539F;&#x672C;&#x60F3;&#x8981;&#x79DF;&#x623F;&#x5B50;&#x5728;&#x5B9C;&#x862D;&#x5E02;&#xFF0C;&#x7136;&#x5F8C;&#x627E;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x7E73;&#x79DF;&#x91D1;&#x8DDF;&#x5B78;&#x8CBB;&#x3002;&#x7D50;&#x679C;&#x771F;&#x7684;&#x60F3;&#x7684;&#x592A;&#x7F8E;&#x4E86;&#xFF0C;&#x73FE;&#x5BE6;&#x751F;&#x6D3B;&#x5C31;&#x662F;&#x7D66;&#x6211;&#x4E00;&#x500B;&#x7576;&#x982D;&#x68D2;&#x559D;&#xFF1A;&#x300C;&#x81EA;&#x7531;&#x8207;&#x6709;&#x6642;&#x9593;&#x5B78;&#x7FD2;&#x517C;&#x9867;&#x662F;&#x5B83;&#x5ABD;&#x7121;&#x6CD5;&#x517C;&#x9867;&#x7684;&#x300D;&#xFF0C;&#x597D;&#x5566;&#xFF0C;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x7121;&#x6CD5;&#x517C;&#x9867;&#x3002;&#x5F8C;&#x4F86;&#x4E00;&#x500B;&#x6708;&#x9322;&#x71D2;&#x5B8C;&#x4E4B;&#x5F8C;&#xFF0C;&#x6211;&#x5C31;&#x56DE;&#x8001;&#x5BB6;&#x4F4F;&#x4E86;&#x3002;</p>
<p>&#x6B38;&#x4E0D;&#x662F;&#xFF0C;&#x7576;&#x5175;&#x5B8C;&#x6703;&#x4E0D;&#x6703;&#x9019;&#x6A23;&#x554A;&#xFF0C;&#x8001;&#x5BE6;&#x8B1B;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x6B38;&#x3002;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x662F;&#x6311;&#x5DE5;&#x4F5C;&#x5230;&#x4E0D;&#x884C;&#x7684;&#x4EBA;&#x6B38;&#xFF0C;&#x5927;&#x5B78;&#x6253;&#x904E;&#x5F97;&#x5DE5;&#x9084;&#x4E0D;&#x5C11;&#xFF0C;&#x4E0D;&#x904E;&#x96E2;&#x8077;&#x904E;&#x5F97;&#x5E97;&#x66F4;&#x591A;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x9023;&#x9396;&#x9910;&#x98F2;&#xFF0C;&#x6709;&#x6A5F;&#x6703;&#x7684;&#x8A71;&#x883B;&#x60F3;&#x5BEB;&#x4E00;&#x7BC7;&#x6253;&#x5DE5;&#x5FC3;&#x5F97;&#x7684;&#xFF0C;&#x7562;&#x7ADF;&#x81EA;&#x5DF1;&#x4E5F;&#x7B97;&#x662F;&#x6253;&#x904E;&#x4E0D;&#x5C11;&#x7684;&#x5DE5;&#xFF0C;&#x61C9;&#x8A72;&#x4F86;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x5FC3;&#x5F97;&#x624D;&#x5C0D;&#x3002;</p>
<p>&#x597D;&#x50CF;&#x6709;&#x9EDE;&#x96E2;&#x984C;&#x4E86;&#xFF0C;&#x4F46;&#x81EA;&#x5DF1;&#x5C0D;&#x65BC;&#x5DE5;&#x4F5C;&#x2026;&#x771F;&#x7684;&#x662F;&#x883B;&#x8981;&#x6C42;&#x7684;&#x3002;&#x5B8C;&#x86CB;&#xFF0C;&#x9084;&#x6C92;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FA3;&#x500B;&#x5B8C;&#x7F8E;&#x4E3B;&#x7FA9;&#x53C8;&#x51FA;&#x73FE;&#x5566;&#x5566;&#x5566;&#x5566;&#x5566;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x73FE;&#x5728;&#x731C;&#x731C;&#x770B;&#x5230;&#x6642;&#x5019;&#x6703;&#x6709;&#x4EC0;&#x9EBC;&#x60C5;&#x5F62;&#x51FA;&#x73FE;&#xFF1A;</p>
<ul>
<li>&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EF;&#x662F;&#x5169;&#x500B;&#x79AE;&#x62DC;&#x5167;&#x53C8;&#x89BA;&#x5F97;&#x9019;&#x9593;&#x516C;&#x53F8;&#x771F;&#x7684;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x60F3;&#x5F85;&#x7684;&#x3002;</li>
<li>&#x61C9;&#x8A72;&#x6703;&#x62FF;&#x5230; 2, 3 &#x500B; offer&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x9078;&#x64C7;&#x54EA;&#x4E00;&#x500B; offer &#x6642;&#x975E;&#x5E38;&#x7684;&#x7336;&#x8C6B;&#x4E0D;&#x6C7A;&#x3002;</li>
</ul>
<p>&#x9019;&#x5169;&#x500B;&#x89BA;&#x5F97;&#x883B;&#x6709;&#x53EF;&#x80FD;&#x6703;&#x51FA;&#x73FE;&#x7684;&#x3002;&#x4E0D;&#x904E;&#x8AB0;&#x77E5;&#x9053;&#x5462;&#xFF0C;&#x7E3D;&#x8981;&#x5148;&#x6709;&#x500B;&#x5DE5;&#x4F5C;&#x624D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5E7E;&#x5169;&#x91CD;&#x5427;&#xFF0C;&#x81EA;&#x5DF1;&#x73FE;&#x5728;&#x5C31;&#x6C92;&#x6709;&#x5DE5;&#x4F5C;&#x7D93;&#x9A57;&#x561B;&#xFF0C;&#x81EA;&#x5DF1;&#x5C31;&#x662F;&#x90A3;&#x9EBC;&#x83DC;&#x6709;&#x4EC0;&#x9EBC;&#x8FA6;&#x6CD5;&#x3002;&#x5BEB;&#x5728;&#x9019;&#x908A;&#x7684;&#x9019;&#x53E5;&#x8A71;&#x5E0C;&#x671B;&#x5230;&#x6642;&#x5019;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x770B;&#x5230; XD</p>
<p>&#x7E3D;&#x4E4B;&#x8981;&#x8AAA;&#x7684;&#x662F;&#xFF0C;&#x81EA;&#x5DF1;&#x9000;&#x4F0D;&#x5F8C;&#x53EF;&#x80FD;&#x6703;&#x6709;&#x5927;&#x6982;&#x5169;&#x4E09;&#x500B;&#x6708;&#x5DE6;&#x53F3;&#x5F88;&#x4E0D;&#x7A69;&#x5B9A;&#x7684;&#x6642;&#x9593;&#xFF0C;&#x7576;&#x7136;&#x9019;&#x500B;&#x6642;&#x9593;&#x4E5F;&#x662F;&#x53EF;&#x9577;&#x53EF;&#x77ED;&#x3002;&#x5305;&#x542B;&#x8981;&#x627E;&#x5DE5;&#x4F5C;&#x3001;&#x7FD2;&#x6163;&#x5DE5;&#x4F5C;&#x3001;&#x642C;&#x5BB6;&#x7B49;&#x7B49;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x5230;&#x5E74;&#x672B;&#x624D;&#x6703;&#x662F;&#x6BD4;&#x8F03;&#x7A69;&#x5B9A;&#x7684;&#x72C0;&#x614B;&#x5427;&#x3002;&#x9019;&#x6A23;&#x60F3;&#x4E0B;&#x4F86;&#xFF0C;&#x8DDD;&#x96E2;&#x90A3;&#x500B;&#x771F;&#x6B63;&#x8E0F;&#x5165;&#x793E;&#x6703;&#x7684;&#x81EA;&#x5DF1;&#x9084;&#x662F;&#x883B;&#x9059;&#x9060;&#x7684;&#x3002;</p>
<h2 id="&#x6709;&#x95DC;&#x65BC;&#x65B0;&#x5E74;&#x7684;&#x76EE;&#x6A19;"><a href="#&#x6709;&#x95DC;&#x65BC;&#x65B0;&#x5E74;&#x7684;&#x76EE;&#x6A19;" class="headerlink" title="&#x6709;&#x95DC;&#x65BC;&#x65B0;&#x5E74;&#x7684;&#x76EE;&#x6A19;"></a>&#x6709;&#x95DC;&#x65BC;&#x65B0;&#x5E74;&#x7684;&#x76EE;&#x6A19;</h2><p>&#x6BCF;&#x4E00;&#x5E74;&#x597D;&#x50CF;&#x5927;&#x5BB6;&#x5728;&#x7E3D;&#x7D50;&#x5B8C;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x5E74;&#x4E4B;&#x5F8C;&#xFF0C;&#x597D;&#x50CF;&#x90FD;&#x6703;&#x7ACB;&#x500B;&#x65B0;&#x5E74;&#x65B0;&#x5E0C;&#x671B;&#x4E4B;&#x985E;&#x7684;&#x6771;&#x897F;&#x3002;&#x65E2;&#x7136;&#x662F;&#x8981;&#x8E0F;&#x51FA;&#x793E;&#x6703;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x90A3;&#x9EBC;&#x4E5F;&#x61C9;&#x8A72;&#x8981;&#x6709;&#x4E00;&#x500B;&#x548C;&#x904E;&#x53BB;&#x4E0D;&#x4E00;&#x6A23;&#x7684;&#x4F5C;&#x6CD5;&#xFF0C;&#x5728;&#x60F3;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#x4E4B;&#x524D;&#xFF0C;&#x90A3;&#x5230;&#x5E95;&#x4EC0;&#x9EBC;&#x662F;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#xFF1F;</p>
<p>&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#xFF0C;&#x64DA;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x61C9;&#x8A72;&#x5C31;&#x662F;&#x4E00;&#x500B;&#x5E0C;&#x671B;&#x660E;&#x5E74;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#x5427;&#xFF0C;&#x65E2;&#x7136;&#x7ACB;&#x4E86;&#xFF0C;&#x5C31;&#x61C9;&#x8A72;&#x7406;&#x6240;&#x7576;&#x7136;&#x8981;&#x505A;&#x5230;&#xFF1F;</p>
<p>&#x5F8C;&#x4F86;&#x767C;&#x73FE;&#x81EA;&#x5DF1;&#x4E00;&#x76F4;&#x4EE5;&#x4F86;&#x7ACB;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#x597D;&#x50CF;&#x5E7E;&#x4E4E;&#x5C31;&#x662F;&#x628A;&#x9084;&#x6C92;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5217;&#x51FA;&#x4F86;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5217;&#x51FA;&#x4F86;&#x3002;&#x5176;&#x5BE6;&#x5728;&#x5BEB;&#x9019;&#x7BC7;&#x6587;&#x7AE0;&#x6642;&#x81EA;&#x5DF1;&#x4E5F;&#x6709;&#x5217;&#x65B0;&#x5E74;&#x9858;&#x671B;&#xFF0C;&#x7136;&#x5F8C;&#x5217;&#x4E86; 20 &#x5E7E;&#x500B;&#x5427;&#x3002;&#x7136;&#x5F8C;&#xFF1A;</p>
<p>&#x4E0D;&#x7528;&#x5230;&#x5E74;&#x672B;&#x6211;&#x5C31;&#x77E5;&#x9053;&#x6211;&#x6703;&#x5931;&#x6557;&#x3002;</p>
<p>&#x5F9E; 24 &#x5E74;&#x7684;&#x7D93;&#x9A57;&#x4F86;&#x770B;&#xFF0C;&#x6211;&#x6703;&#x5931;&#x6557;&#x3002;&#x5728;&#x751F;&#x6D3B;&#x7684;&#x85DD;&#x8853;&#x9019;&#x672C;&#x66F8;&#x6709;&#x770B;&#x5230;&#x985E;&#x4F3C;&#x9019;&#x500B;&#x610F;&#x601D;&#x7684;&#x4E00;&#x53E5;&#x8A71;&#x7684;&#x8A71;&#xFF1A;&#x300C;&#x6211;&#x5011;&#x7E3D;&#x662F;&#x628A;&#x672A;&#x4F86;&#x7684;&#x81EA;&#x5DF1;&#x60F3;&#x6210;&#x5B8C;&#x7F8E;&#x7684;&#x81EA;&#x5DF1;&#x300D;&#x3002;&#x5C31;&#x597D;&#x50CF;&#x4ECA;&#x5E74;&#x7684;&#x81EA;&#x5DF1;&#x662F;&#x90A3;&#x7A2E;&#x5F88;&#x7CDF;&#x7684; PM&#xFF0C;&#x660E;&#x5E74;&#x7684;&#x81EA;&#x5DF1;&#x662F;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x4F46;&#x9019;&#x4F4D; PM &#xFF08;&#x73FE;&#x5728;&#x7684;&#x81EA;&#x5DF1;&#xFF09;&#x5B8C;&#x5168;&#x4E0D;&#x5728;&#x4E4E;&#x5DE5;&#x7A0B;&#x5E2B;&#x7684;&#x8CC7;&#x6B77;&#x3001;&#x72C0;&#x6CC1;&#xFF0C;&#x760B;&#x72C2;&#x767C; ticket&#xFF0C;&#x5B8C;&#x5168;&#x6C92;&#x6709; Priority&#x3002;</p>
<p>&#x7136;&#x5F8C;&#x660E;&#x5E74;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#x5C31;&#x56E0;&#x70BA;&#x9019;&#x4F4D; PM &#x5F04;&#x7684;&#x5DE5;&#x4F5C;&#x5F88;&#x6C92;&#x81EA;&#x4FE1;&#xFF0C;&#x7136;&#x5F8C;&#x5C31;<del>&#x96E2;&#x8077;&#x4E86;</del>&#xFF08;&#x62DC;&#x8A17;&#xFF0C;&#x5148;&#x4E0D;&#x8981;&#x5F9E;&#x4EBA;&#x751F;&#x96E2;&#x8077;&#xFF09;&#x5F88;&#x4E0D;&#x958B;&#x5FC3;&#x7684;&#x5728;&#x5DE5;&#x4F5C;&#x3002;&#x90A3;&#x5DE5;&#x7A0B;&#x5E2B;&#x7684;&#x9B31;&#x9B31;&#x5BE1;&#x6B61;&#x4E5F;&#x4E0D;&#x662F;&#x56E0;&#x70BA;&#x4ED6;&#x7684;&#x80FD;&#x529B;&#x4E0D;&#x597D;&#xFF0C;&#x662F; PM &#x7684;&#x554F;&#x984C;&#xFF0C;PM &#x53EF;&#x80FD;&#x61C9;&#x8A72;&#x5148;&#x548C;&#x5DE5;&#x7A0B;&#x5E2B;&#x6E9D;&#x901A;&#x4E00;&#x4E0B;&#x518D;&#x958B; ticket&#x3002;</p>
<p>&#x4E0D;&#x904E;&#x4ECA;&#x5E74;&#x7684;&#x81EA;&#x5DF1;&#x4E5F;&#x6C92;&#x8FA6;&#x6CD5;&#x548C;&#x672A;&#x4F86;&#x7684;&#x81EA;&#x5DF1;&#x6E9D;&#x901A;&#xFF0C;&#x751A;&#x81F3;&#x9023;&#x81EA;&#x5DF1;&#x672A;&#x4F86;&#x7684;&#x72C0;&#x6CC1;&#x771F;&#x7684;&#x5F88;&#x96E3;&#x8AAA;&#xFF0C;&#x4EBA;&#x751F;&#x5C31;&#x662F;&#x9019;&#x9EBC;&#x7121;&#x5E38;&#x3002;&#x60F3;&#x5C0D;&#x73FE;&#x5728;&#x7684;&#x81EA;&#x5DF1;&#x8AAA;&#x7684;&#x662F;&#xFF0C;&#x90A3;&#x7A2E;&#x60F3;&#x5230;&#x4EC0;&#x9EBC;&#x5C31;&#x653E;&#x9032;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#x7684;&#x65B9;&#x5F0F;&#x5F88;&#x660E;&#x986F;&#x4E0D;&#x5408;&#x7406;&#xFF0C;&#x4E0D;&#x904E;&#x81EA;&#x5DF1;&#x53C8;&#x80FD;&#x81EA;&#x5DF1;&#x4EC0;&#x9EBC;&#x6A23;&#x7684;&#x671F;&#x8A31;&#x548C;&#x76EE;&#x6A19;&#x5462;&#xFF1F;&#x56E0;&#x70BA;&#x4E0D;&#x77E5;&#x9053;&#x672A;&#x4F86;&#x7684;&#x72C0;&#x6CC1;&#x600E;&#x9EBC;&#x6A23;&#xFF0C;&#x6240;&#x4EE5;&#x6C92;&#x8FA6;&#x6CD5;&#x7D66;&#x672A;&#x4F86;&#x7684;&#x81EA;&#x5DF1;&#x4E00;&#x500B;&#x76EE;&#x6A19;&#xFF0C;&#x4F46;&#x662F;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#x5C31;&#x662F;&#x4E00;&#x500B;&#x672A;&#x4F86;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#x672C;&#x8EAB;&#x662F;&#x4E0D;&#x662F;&#x5C31;&#x662F;&#x4E00;&#x500B;&#x6096;&#x8AD6;&#xFF1F;</p>
<p>&#x597D;&#x50CF;&#x626F;&#x592A;&#x9060;&#x4E86;&#xFF0C;&#x55AE;&#x7D14;&#x9EDE;&#x5427;&#xFF0C;&#x4EC0;&#x9EBC;&#x770B;&#x5B8C; ES3 &#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x9084;&#x6709;&#x5B78;&#x6703; typescript &#x9019;&#x4E9B;&#x6771;&#x897F;&#x662F;&#x4E0D;&#x662F;&#x90FD;&#x4E0D;&#x9069;&#x5408;&#x653E;&#x5728;&#x9019;&#x500B;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#x4E2D;&#xFF1F;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#x61C9;&#x8A72;&#x8981;&#x662F;&#xFF1A;&#x300C;&#x4E0D;&#x8AD6;&#x767C;&#x751F;&#x4EC0;&#x9EBC;&#x72C0;&#x6CC1;&#xFF0C;&#x9019;&#x4E00;&#x5E74;&#x90FD;&#x5FC5;&#x9808;&#x8981;&#x9054;&#x6210;&#x7684;&#x6771;&#x897F;&#x300D;&#xFF0C;&#x76EE;&#x6A19;&#x5FC5;&#x9808;&#x7B26;&#x5408;&#x9019;&#x500B;&#x689D;&#x4EF6;&#xFF0C;&#x624D;&#x80FD;&#x89E3;&#x6C7A;&#x4E0A;&#x9762;&#x7684;&#x554F;&#x984C;&#x624D;&#x662F;&#x3002;</p>
<p>&#x7D93;&#x904E;&#x4E0A;&#x9762;&#x7684;&#x689D;&#x4EF6;&#xFF0C;&#x7136;&#x5F8C;&#x601D;&#x8003;&#x4E4B;&#x5F8C;&#xFF0C;&#x81EA;&#x5DF1;&#x7D66;&#x81EA;&#x5DF1;&#x56DB;&#x500B; 2021 &#x5E74;&#x7684;&#x76EE;&#x6A19;&#xFF1A;</p>
<ol>
<li>&#x627E;&#x56DE;&#x5C08;&#x6CE8;&#x529B;</li>
<li>&#x7D66;&#x81EA;&#x5DF1;&#x4E00;&#x5957;&#x5C08;&#x6848;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x6CD5;</li>
<li>&#x5206;&#x4EAB;</li>
</ol>
<p>&#x5728;&#x9019;&#x88E1;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x8AAA;&#x70BA;&#x4EC0;&#x9EBC;&#x6703;&#x6709;&#x9019;&#x4E09;&#x9EDE;&#xFF0C;&#x4E5F;&#x662F;&#x7D66;&#x672A;&#x4F86;&#x7684;&#x81EA;&#x5DF1;&#x4E00;&#x500B;&#x5099;&#x5FD8;&#x9304;</p>
<h3 id="&#x627E;&#x56DE;&#x5C08;&#x6CE8;&#x529B;"><a href="#&#x627E;&#x56DE;&#x5C08;&#x6CE8;&#x529B;" class="headerlink" title="&#x627E;&#x56DE;&#x5C08;&#x6CE8;&#x529B;"></a>&#x627E;&#x56DE;&#x5C08;&#x6CE8;&#x529B;</h3><p>&#x4ECA;&#x5E74;&#x7684;&#x5C08;&#x6CE8;&#x529B;&#x4E00;&#x76F4;&#x883B;&#x4E0D;&#x597D;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x56DE;&#x4F86;&#x5B9C;&#x862D;&#x4E4B;&#x5F8C;&#xFF0C;&#x6709;&#x4E00;&#x500B;&#x883B;&#x660E;&#x986F;&#x7684;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x70BA;&#x7562;&#x7ADF;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x623F;&#x9593;&#xFF0C;&#x6709;&#x883B;&#x591A;&#x6771;&#x897F;&#x53EF;&#x4EE5;&#x8B93;&#x81EA;&#x5DF1;&#x5206;&#x5FC3;&#x7684;&#xFF0C;&#x5DF2;&#x7D93;&#x6709;&#x9EDE;&#x56B4;&#x91CD;&#x5230;&#x8AAA;&#x56DE;&#x5BB6;&#x505A;&#x4E8B;&#x7684;&#x6548;&#x7387;&#x5927;&#x6253;&#x6298;&#x6263;&#x3002;&#x5E38;&#x5E38;&#x5206;&#x5FC3;&#x5230;&#x53BB;&#x770B;&#x6F2B;&#x756B;&#x9084;&#x6709; youtube&#xFF0C;&#x8B93;&#x81EA;&#x5DF1;&#x751F;&#x7522;&#x529B;&#x8D85;&#x7D1A;&#x4F4E;&#x4E0B;&#x3002;&#x7576;&#x7136;&#x4E5F;&#x4E0D;&#x662F;&#x8AAA;&#x4E0D;&#x80FD;&#x770B;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x7A2E;&#x7761;&#x524D;&#x770B;&#x5230;&#x7761;&#x8457;&#x5C31;&#x4E0D;&#x592A;&#x597D;&#x4E86;&#x3002;&#x7576;&#x665A;&#x5C31;&#x7B97;&#x7761;&#x89BA;&#x7761;&#x7720;&#x54C1;&#x8CEA;&#x4E5F;&#x5F88;&#x5DEE;&#xFF0C;&#x96A8;&#x8457;&#x5E74;&#x9F61;&#x589E;&#x9577;&#x7761;&#x7720;&#x54C1;&#x8CEA;&#x771F;&#x7684;&#x8D8A;&#x4F86;&#x8D8A;&#x91CD;&#x8981;&#xFF0C;&#x6709;&#x6C92;&#x6709;&#x7761;&#x597D;&#x5927;&#x5927;&#x5F71;&#x97FF;&#x9694;&#x5929;&#x8166;&#x888B;&#x7684;&#x6E05;&#x9192;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x9084;&#x6709;&#x81EA;&#x5DF1;&#x4E00;&#x9047;&#x5230;&#x6BD4;&#x8F03;&#x9700;&#x8981;&#x601D;&#x8003;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x6BD4;&#x8F03;&#x56F0;&#x96E3;&#x7684;&#x90E8;&#x4EFD;&#xFF0C;&#x5C31;&#x6703;&#x958B;&#x59CB;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x7684;&#x60F3;&#x8981;&#x6ED1;&#x624B;&#x6A5F;&#x3002;&#x5206;&#x5FC3;&#x5DF2;&#x7D93;&#x8B8A;&#x6210;&#x81EA;&#x5DF1;&#x6F5B;&#x610F;&#x8B58;&#x4E2D;&#x4E00;&#x7A2E;&#x6230;&#x8207;&#x9003;&#x7684;&#x53CD;&#x61C9;&#xFF0C;&#x9047;&#x5230;&#x56F0;&#x96E3;&#x6642;&#x5019;&#x5C31;&#x6703;&#x60F3;&#x8981;&#x6ED1;&#x4E00;&#x4E0B;&#x5B89;&#x64AB;&#x7DCA;&#x5F35;&#x7684;&#x60C5;&#x7DD2;&#x3002;</p>
<p>&#x7E3D;&#x4E4B;&#x5E0C;&#x671B;&#x627E;&#x56DE;&#x81EA;&#x5DF1;&#x7684;&#x5C08;&#x6CE8;&#x529B;&#xFF0C;&#x4E0D;&#x904E;&#x5176;&#x5BE6;&#x9019;&#x53EA;&#x662F;&#x4E00;&#x500B;&#x883B;&#x5927;&#x65B9;&#x5411;&#x7684;&#x76EE;&#x6A19;&#x800C;&#x5DF2;&#xFF0C;&#x8981;&#x5B8C;&#x6210;&#x9019;&#x500B;&#x76EE;&#x6A19;&#x4E5F;&#x9700;&#x8981;&#x5F88;&#x591A;&#x5BE6;&#x969B;&#x7684;&#x884C;&#x52D5;&#xFF0C;&#x76EE;&#x524D;&#x60F3;&#x5230;&#x5E7E;&#x9EDE;&#xFF1A;</p>
<ul>
<li>&#x5E6B;&#x81EA;&#x5DF1;&#x642D;&#x5EFA;&#x4E00;&#x500B;&#x4E0D;&#x5BB9;&#x6613;&#x5206;&#x5FC3;&#x7684;&#x74B0;&#x5883;</li>
<li>&#x5BDF;&#x89BA;&#x81EA;&#x5DF1;&#x5206;&#x5FC3;&#x7684;&#x904E;&#x7A0B;&#xFF0C;&#x4E26;&#x8A18;&#x9304;&#x4E0B;&#x4F86;</li>
<li>&#x51A5;&#x60F3;&#x7DF4;&#x7FD2;</li>
<li>&#x6539;&#x8B8A;&#x98F2;&#x98DF;&#x7FD2;&#x6163;</li>
<li>&#x904B;&#x52D5;</li>
<li>&#x8543;&#x8304;&#x9418;&#x5DE5;&#x4F5C;&#x6CD5;</li>
</ul>
<p>&#x4F9D;&#x7167;&#x5230;&#x6642;&#x5019;&#x7684;&#x74B0;&#x5883;&#x4E0D;&#x540C;&#xFF0C;&#x80FD;&#x57F7;&#x884C;&#x7684;&#x65B9;&#x5F0F;&#x4E5F;&#x883B;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x50CF;&#x7576;&#x5175;&#x5C31;&#x7D55;&#x5C0D;&#x4E0D;&#x53EF;&#x80FD;&#x53BB;&#x5EFA;&#x7ACB;&#x4E00;&#x500B;&#x81EA;&#x5DF1;&#x7684;&#x74B0;&#x5883;&#xFF0C;&#x4F46;&#x662F;&#x904B;&#x52D5;&#x5C31;&#x53EF;&#x4EE5;&#x3002;&#x7576;&#x7136;&#x65B9;&#x6CD5;&#x4E5F;&#x4E0D;&#x53EA;&#x4E0A;&#x9762;&#x5E7E;&#x7A2E;&#xFF0C;&#x5728; 2021 &#x5E74;&#xFF0C;&#x7528;&#x76E1;&#x5404;&#x7A2E;&#x5617;&#x8A66;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#x8B93;&#x81EA;&#x5DF1;&#x5C08;&#x6CE8;&#x3002;</p>
<h3 id="&#x7D66;&#x81EA;&#x5DF1;&#x4E00;&#x5957;&#x5C08;&#x6848;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x7D66;&#x81EA;&#x5DF1;&#x4E00;&#x5957;&#x5C08;&#x6848;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x7D66;&#x81EA;&#x5DF1;&#x4E00;&#x5957;&#x5C08;&#x6848;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x6CD5;"></a>&#x7D66;&#x81EA;&#x5DF1;&#x4E00;&#x5957;&#x5C08;&#x6848;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x6CD5;</h3><p>&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x70BA;&#x81EA;&#x5DF1;&#x5F88;&#x5BB9;&#x6613;&#x5FD8;&#x8A18;&#x4E8B;&#x60C5;&#xFF0C;&#x50CF;&#x662F;&#x7E73;&#x505C;&#x8ECA;&#x8CBB;&#x4E4B;&#x985E;&#x7684;&#x7463;&#x4E8B;&#x5E38;&#x5E38;&#x6703;&#x5FD8;&#x8A18;&#x3002;&#x95DC;&#x65BC;&#x9019;&#x9EDE;&#x6211;&#x6703;&#x89BA;&#x5F97;&#x662F;&#x56E0;&#x70BA;&#x4ECA;&#x5E74;&#x4E0D;&#x5920;&#x5FD9;&#x788C;&#xFF0C;&#x6240;&#x4EE5;&#x9084;&#x4E0D;&#x9700;&#x8981;&#x4E00;&#x500B;&#x7CFB;&#x7D71;&#x4F86;&#x5E6B;&#x81EA;&#x5DF1;&#x7BA1;&#x7406;&#x9019;&#x4E9B;&#x5F85;&#x8FA6;&#x4E8B;&#x9805;&#x3002;&#x4F46;&#x6703;&#x89BA;&#x5F97;&#x4E0D;&#x5920;&#x5FD9;&#x788C;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x4EE3;&#x8868;&#x8AAA;&#x81EA;&#x5DF1;&#x9084;&#x6709;&#x66F4;&#x591A;&#x6642;&#x9593;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5427;&#xFF1F;</p>
<p>&#x518D;&#x4F86;&#x662F;&#x6709;&#x5F88;&#x591A;&#x9700;&#x8981;&#x627E;&#x4E00;&#x500B;&#x5730;&#x65B9;&#x653E;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x53EF;&#x4EE5;&#x505A;&#x53C3;&#x8003;&#x7684;&#x8CC7;&#x6599;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x60F3;&#x8981;&#x4E4B;&#x5F8C;&#x518D;&#x8B80;&#x7684;&#x5167;&#x5BB9;&#x5E38;&#x5E38;&#x6C92;&#x6709;&#x4E00;&#x500B;&#x5730;&#x65B9;&#x653E;&#xFF0C;&#x6700;&#x5F8C;&#x5C31;&#x6D88;&#x5931;&#x5728;&#x8166;&#x888B;&#x9084;&#x6709;&#x96FB;&#x8166;&#x4E2D;&#x3002;&#x9019;&#x4E9B;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x7D2F;&#x7A4D;&#x7684;&#x6771;&#x897F;&#x771F;&#x7684;&#x5F88;&#x73CD;&#x8CB4;&#xFF0C;&#x5C31;&#x9019;&#x6A23;&#x4E0D;&#x898B;&#x89BA;&#x5F97;&#x9019;&#x883B;&#x53EF;&#x60DC;&#x7684;&#x3002;</p>
<p>&#x5F8C;&#x4F86;&#x60F3;&#x60F3;&#x81EA;&#x5DF1;&#x61C9;&#x8A72;&#x8981;&#x6709;&#x4E00;&#x5957;&#x7BA1;&#x7406;&#x5C08;&#x6848;&#x9084;&#x6709;&#x4EE3;&#x8FA6;&#x4E8B;&#x9805;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5176;&#x5BE6; 2020 &#x6709;&#x7A0D;&#x5FAE;&#x4E86;&#x89E3;&#x4E00;&#x4E0B; GTD &#x7684;&#x5167;&#x5BB9;&#xFF0C;&#x611F;&#x89BA;&#x4E5F;&#x5F88;&#x4E0D;&#x932F;&#xFF0C;&#x4E0D;&#x904E;&#x6C92;&#x6709;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x8A8D;&#x8B58;&#x3002;&#x76EE;&#x524D;&#x60F3;&#x5230;&#x7684;&#x5BE6;&#x969B;&#x884C;&#x52D5;&#x6709;</p>
<ul>
<li>&#x627E; GTD &#x76F8;&#x95DC;&#x7684;&#x66F8;&#x4F86;&#x770B;</li>
<li>&#x57F9;&#x990A;&#x4E00;&#x5957;&#x7D00;&#x9304;&#x7684;&#x7FD2;&#x6163;</li>
</ul>
<p>&#x5176;&#x5BE6;&#x60F3;&#x5230;&#x65B9;&#x6CD5;&#x4E5F;&#x6C92;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x89BA;&#x5F97;&#x8981;&#x518D;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x3002;&#x5728; 2021 &#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x719F;&#x6089;&#x4EE5;&#x53CA;&#x5167;&#x5316;&#x4E00;&#x5957;&#x65B9;&#x6CD5;&#xFF0C;&#x8B93;&#x81EA;&#x5DF1;&#x66F4;&#x597D;&#x7684;&#x7BA1;&#x7406;&#x9700;&#x8981;&#x57F7;&#x884C;&#x7684;&#x5C08;&#x6848;&#x4EE5;&#x53CA;&#x65E5;&#x5E38;&#x78B0;&#x5230;&#x7684;&#x60F3;&#x6CD5;&#x3002;</p>
<h3 id="&#x5206;&#x4EAB;"><a href="#&#x5206;&#x4EAB;" class="headerlink" title="&#x5206;&#x4EAB;"></a>&#x5206;&#x4EAB;</h3><p>&#x6703;&#x60F3;&#x958B;&#x59CB;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x4E5F;&#x662F;&#x53D7;&#x5230; Huli &#x9084;&#x6709;&#x8AB2;&#x7A0B;&#x7684;&#x5F71;&#x97FF;&#x3002;&#x9019;&#x5E7E;&#x5929;&#x56DE;&#x982D;&#x770B;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x5BEB;&#x7684;&#x4F5C;&#x696D;&#xFF0C;&#x6709;&#x4E9B;&#x6771;&#x897F;&#x771F;&#x7684;&#x6574;&#x7406;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x81EA;&#x5DF1;&#x5C0D;&#x65BC;&#x54C1;&#x8CEA;&#x9084;&#x6709;&#x5167;&#x5BB9;&#x4E5F;&#x70BA;&#x4E4B;&#x9A5A;&#x5606;&#x3002;&#x800C;&#x4E14;&#x7576;&#x5FD8;&#x8A18;&#x7684;&#x6642;&#x5019;&#x56DE;&#x904E;&#x982D;&#x4F86;&#x770B;&#xFF0C;&#x4E5F;&#x6BD4;&#x8F03;&#x5BB9;&#x6613;&#x52FE;&#x8D77;&#x8A18;&#x61B6;&#x3002;&#x9019;&#x6A23;&#x5BEB;&#x4E0B;&#x4F86;&#x767C;&#x73FE;&#x8AAA;&#x5BEB;&#x6210;&#x6587;&#x7AE0;&#x6709;&#x5E7E;&#x500B;&#x597D;&#x8655;&#xFF1A;</p>
<p>&#x4E00;&#x500B;&#x662F;&#x56E0;&#x70BA;&#x60F3;&#x5C0D;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#x6709;&#x6240;&#x8981;&#x6C42;&#x3002;&#x5E38;&#x5E38;&#x60F3;&#x6771;&#x897F;&#x6703;&#x89BA;&#x5F97;&#xFF1A;&#x300C;&#x5594;&#xFF5E;&#x539F;&#x4F86;&#x5C31;&#x662F;&#x9019;&#x6A23;&#xFF0C;&#x90A3;&#x6211;&#x61C2;&#x4E86;&#x300D;&#xFF0C;&#x5C0D;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x597D;&#x50CF;&#x53EA;&#x6709;&#x300C;&#x5927;&#x6982;&#x61C2;&#x300D;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x6253;&#x6210;&#x6587;&#x7AE0;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x53EF;&#x4EE5;&#x5448;&#x73FE;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x6211;&#x60F3;&#x61C9;&#x8A72;&#x6703;&#x6709;&#x66F4;&#x6DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5BEB;&#x6587;&#x7AE0;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#x627E;&#x5230;&#x66F4;&#x591A;&#x7684;&#x554F;&#x984C;&#xFF1F;</p>
<p>&#x518D;&#x4F86;&#x6253;&#x6210;&#x6587;&#x7AE0;&#x6703;&#x5F37;&#x8FEB;&#x81EA;&#x5DF1;&#x6574;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x5167;&#x5BB9;&#xFF0C;&#x6574;&#x7406;&#x6210;&#x300C;&#x5176;&#x4ED6;&#x4EBA;&#x65B9;&#x4FBF;&#x770B;&#x7684;&#x300D;&#x5F62;&#x5F0F;&#xFF0C;&#x800C;&#x9019;&#x6A23;&#x7684;&#x5F62;&#x5F0F;&#x901A;&#x5E38;&#x81EA;&#x5DF1;&#x6703;&#x770B;&#x5F97;&#x61C2;&#x3002;&#x81EA;&#x5DF1;&#x5F88;&#x5E38;&#x767C;&#x751F;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x7B46;&#x8A18;&#x81EA;&#x5DF1;&#x770B;&#x4E0D;&#x61C2;&#xFF0C;&#x8A18;&#x7B46;&#x8A18;&#x7684;&#x7576;&#x4E0B;&#x901A;&#x5E38;&#x6703;&#x6BD4;&#x8F03;&#x8D95;&#xFF0C;&#x53EA;&#x60F3;&#x505A;&#x500B;&#x7D00;&#x9304;&#xFF0C;&#x5F8C;&#x4F86;&#x6C92;&#x6709;&#x6574;&#x7406;&#x5F88;&#x5FEB;&#x5C31;&#x6703;&#x5FD8;&#x8A18;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x5BEB;&#x6210;&#x6587;&#x7AE0;&#x7B49;&#x65BC;&#x53C8;&#x91CD;&#x65B0;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x6B21;&#x81EA;&#x5DF1;&#x8166;&#x888B;&#x88E1;&#x9762;&#x7684;&#x8A18;&#x61B6;&#xFF0C;&#x4E5F;&#x66F4;&#x4E0D;&#x5BB9;&#x6613;&#x5FD8;&#x8A18;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5BEB;&#x6587;&#x7AE0;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x5F88;&#x9700;&#x8981;&#x52D5;&#x529B;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x60F3;&#x5206;&#x4EAB;&#x7684;&#x865B;&#x69AE;&#x5FC3;&#x61C9;&#x8A72;&#x662F;&#x500B;&#x5F88;&#x597D;&#x7684;&#x52D5;&#x529B;&#x3002;&#x9084;&#x6709;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x81EA;&#x5DF1;&#x5F88;&#x5BB9;&#x6613;&#x5FD8;&#x8A18;&#x6771;&#x897F;&#x653E;&#x5728;&#x54EA;&#xFF0C;&#x6709;&#x500B;&#x7DB2;&#x7AD9;&#x653E;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x7AE0;&#x5C31;&#x6BD4;&#x8F03;&#x4E0D;&#x6703;&#x6709;&#x9019;&#x500B;&#x554F;&#x984C;&#xFF0C;&#x800C;&#x4E14;&#x96A8;&#x6642;&#x53EF;&#x4EE5;&#x770B;&#xFF0C;&#x6240;&#x4EE5;&#x8207;&#x5176;&#x8AAA;&#x662F;&#x90E8;&#x843D;&#x683C;<strong>&#x4E0D;&#x5982;&#x8AAA;&#x662F;&#x5099;&#x5FD8;&#x9304;</strong>&#x5427;&#x3002;&#x7D93;&#x71DF;&#x500B;&#x4EBA;&#x54C1;&#x724C;&#x4EC0;&#x9EBC;&#x7684;&#x81EA;&#x5DF1;&#x5012;&#x4E0D;&#x662F;&#x5F88;&#x5728;&#x4E4E;&#xFF0C;&#x73FE;&#x5728;&#x597D;&#x50CF;&#x6BCF;&#x500B;&#x4EBA;&#x90FD;&#x5728;&#x505A;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5C0D;&#x525B;&#x8D77;&#x6B65;&#x7684;&#x81EA;&#x5DF1;&#x800C;&#x8A00;&#xFF0C;&#x9084;&#x662F;&#x5148;&#x958B;&#x59CB;&#x5BEB;&#x4E00;&#x4E9B;&#x6771;&#x897F;&#x5C31;&#x597D;&#x3002;</p>
<p>&#x5206;&#x4EAB;&#x9084;&#x6709;&#x60F3;&#x5230;&#x4E00;&#x9EDE;&#xFF0C;&#x4E5F;&#x4E0D;&#x53EA;&#x8AAA;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x6280;&#x8853;&#x5C64;&#x9762;&#x7684;&#x5167;&#x5BB9;&#xFF0C;&#x53EF;&#x80FD;&#x4E5F;&#x6703;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#x6216;&#x8005;&#x662F;&#x4E00;&#x4E9B;&#x9047;&#x5230;&#x7684;&#x72C0;&#x6CC1;&#x3002;&#x60F3;&#x8A66;&#x8457;&#x85C9;&#x7531;&#x5206;&#x4EAB;&#x9019;&#x4E9B;&#x5167;&#x5BB9;&#xFF0C;&#x4F86;&#x66F4;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#xFF0C;&#x4EE5;&#x53CA;&#x62B1;&#x6301;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x958B;&#x9084;&#x6709;&#x900F;&#x660E;&#xFF0C;&#x9019;&#x9EDE;&#x662F;&#x81EA;&#x5DF1;&#x5728;&#x539F;&#x5247;&#x9019;&#x672C;&#x66F8;&#x4E2D;&#x6240;&#x770B;&#x5230;&#x7684;&#x3002;&#x7576;&#x7136;&#x4E5F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x96B1;&#x79C1;&#x90FD;&#x6703;&#x516C;&#x958B;&#xFF0C;&#x4F46;&#x6211;&#x89BA;&#x5F97;&#x5728;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#x9084;&#x6709;&#x61C9;&#x5C0D;&#x4E0A;&#xFF0C;&#x4FDD;&#x6301;&#x900F;&#x660E;&#x7684;&#x5FC3;&#x614B;&#x53EF;&#x4EE5;&#x8B93;&#x81EA;&#x5DF1;&#x9032;&#x6B65;&#x7684;&#x66F4;&#x5FEB;&#xFF0C;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x53BB;&#x63A5;&#x7D0D;&#x4E0D;&#x540C;&#x7684;&#x770B;&#x6CD5;&#x548C;&#x5EFA;&#x8B70;&#x3002;</p>
<p>&#x60F3;&#x5230;&#x7684;&#x5BE6;&#x969B;&#x884C;&#x52D5;&#xFF1A;</p>
<ul>
<li>&#x628A; Blog &#x6574;&#x7406;&#x4E00;&#x4E0B;&#xFF0C;&#x8ABF;&#x6574;&#x4E00;&#x4E0B;&#x7248;&#x9762;&#x8B8A;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x5F62;&#x72C0;</li>
<li>&#x81EA;&#x5DF1;&#x7684;&#x4E4B;&#x524D;&#x7522;&#x51FA;&#x7684;&#x5167;&#x5BB9;&#x53EF;&#x4EE5;&#x5148;&#x4E1F;&#x5230; Medium &#x4E0A;&#x9762;</li>
<li>&#x505A;&#x5C08;&#x6848;&#x3001;&#x5B78;&#x7FD2;&#x65B0;&#x7684;&#x6771;&#x897F;&#x6642;&#xFF0C;&#x8A66;&#x8457;&#x628A;&#x7B46;&#x8A18;&#x6574;&#x7406;&#x6210;&#x6BD4;&#x8F03;&#x5B8C;&#x6574;&#x7684;&#x6587;&#x7AE0;</li>
<li>&#x4F5C;&#x7B46;&#x8A18;&#xFF08;&#x6C92;&#x932F;&#xFF0C;&#x81EA;&#x5DF1;&#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x9760;&#x8166;&#x888B;&#x8A18;&#x7684;&#xFF0C;&#x5F88;&#x4E0D;&#x7262;&#x9760;&#xFF09;</li>
</ul>
<p>&#x8207;&#x5176;&#x8AAA;&#x76EE;&#x6A19;&#x662F;&#x5206;&#x4EAB;&#xFF0C;&#x5176;&#x5BE6;&#x628A;&#x5167;&#x5BB9;&#x6574;&#x7406;&#x6210;&#x6587;&#x7AE0;&#x624D;&#x662F;&#x81EA;&#x5DF1;&#x60F3;&#x9054;&#x5230;&#x7684;&#x76EE;&#x6A19;&#x3002;&#x81EA;&#x5DF1;&#x76EE;&#x524D;&#x5BEB;&#x6587;&#x7AE0;&#x7684;&#x901F;&#x5EA6;&#x9084;&#x5F88;&#x6162;&#xFF08;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x81EA;&#x5DF1;&#x592A;&#x62D6;&#x5EF6;&#x5566;&#x2026;&#xFF09;&#xFF0C;&#x4E5F;&#x9084;&#x6C92;&#x627E;&#x5230;&#x4E00;&#x500B;&#x597D;&#x7684;&#x5167;&#x5BB9;&#x5F62;&#x5F0F;&#x9084;&#x6709;&#x7FD2;&#x6163;&#x7684;&#x751F;&#x7522;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x80FD;&#x591A;&#x5BEB;&#x5C31;&#x6703;&#x6709;&#x4E86;&#x5427;&#xFF1F;&#x7E3D;&#x4E4B;&#x4E5F;&#x662F;&#x4E14;&#x6230;&#x4E14;&#x8D70;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6B21;&#x9019;&#x9EBC;&#x4ED4;&#x7D30;&#x7684;&#x53BB;&#x601D;&#x8003;&#x9019;&#x4E9B;&#x95DC;&#x65BC;&#x65B0;&#x5E74;&#x65B0;&#x5E0C;&#x671B;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x4E0D;&#x904E;&#x96E3;&#x9053;&#x5206;&#x6790;&#x9019;&#x9EBC;&#x591A;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x9858;&#x671B;&#x5C31;&#x6703;&#x9054;&#x6210;&#x55CE;&#xFF1F;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x5B9A;&#xFF0C;&#x641E;&#x4E0D;&#x597D;&#x548C;&#x904E;&#x53BB;&#x4E00;&#x6A23;&#x5B8C;&#x5168;&#x7121;&#x6CD5;&#x7B54;&#x6A19;&#x4E5F;&#x8AAA;&#x4E0D;&#x5B9A;&#x3002;&#x9084;&#x6709;&#x96D6;&#x7136;&#x4E0A;&#x9762;&#x5217;&#x7684;&#x662F;&#x65B0;&#x5E74;&#x76EE;&#x6A19;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x4EE3;&#x8868; 2021 &#x53EA;&#x5B8C;&#x6210;&#x9019;&#x4E9B;&#x76EE;&#x6A19;&#x800C;&#x5DF2;&#xFF0C;&#x53CD;&#x800C;&#x9019;&#x4E9B;&#x76EE;&#x6A19;&#x512A;&#x5148;&#x5EA6;&#x6703;&#x6BD4;&#x6C42;&#x8077;&#x3001;&#x63D0;&#x6607;&#x6280;&#x80FD;&#x512A;&#x5148;&#x9806;&#x5E8F;&#x4F86;&#x7684;&#x66F4;&#x4F4E;&#x3002;</p>
<h2 id="&#x7E3D;&#x7D50;"><a href="#&#x7E3D;&#x7D50;" class="headerlink" title="&#x7E3D;&#x7D50;"></a>&#x7E3D;&#x7D50;</h2><p>&#x95DC;&#x65BC; 2020 &#x7684;&#x4E00;&#x500B;&#x7E3D;&#x7D50;&#xFF0C;&#x9084;&#x6709; 2021 &#x7684;&#x671F;&#x8A31;&#x4E5F;&#x5DEE;&#x4E0D;&#x591A;&#x5230;&#x9019;&#x908A;&#x4E86;&#x3002;2020 &#x5C0D;&#x6211;&#x800C;&#x8A00;&#x7B97;&#x662F;&#x4E00;&#x500B;&#x8F49;&#x6369;&#x9EDE;&#xFF0C;&#x4E0D;&#x904E; 2021 &#x66F4;&#x50CF;&#x662F;&#x4E00;&#x500B;&#x8D77;&#x9EDE;&#xFF0C;&#x50CF;&#x9032;&#x5165;&#x4E0B;&#x4E00;&#x500B;&#x6A02;&#x7AE0;&#x7684;&#x611F;&#x89BA;&#x3002;&#x5C0D;&#x65BC; 2021 &#xFF0C;&#x5C31;&#x5148;&#x8D70;&#x8D70;&#x770B;&#x518D;&#x8AAA;&#x5427;&#x3002;</p>
<p>Big guy is john&#xFF0C;&#x795D;&#x5927;&#x5BB6;&#x65B0;&#x5E74;&#x5FEB;&#x6A02;&#x3002;</p>
</body></html>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2020/09/01/redirect_status_code/">關於重新導向的 status code</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="notification is-danger">
    You need to set <code>install_url</code> to use ShareThis. Please set it in <code>_config.yml</code>.
</div>

</div>



<div class="comments">
    <h3 class="title is-4">Comments</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yoursite.com/2021/01/02/2020_2021/';
        this.page.identifier = '2021/01/02/2020_2021/';
        
        this.language = 'en';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'lauviah0622' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a target="_blank" rel="noopener" href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2021 John Doe&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        target="_blank" rel="noopener" href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" target="_blank" rel="noopener" href="https://github.com/Lauviah0622">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" target="_blank" rel="noopener" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("en-AU");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="Type something..." />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: 'Posts',
                PAGES: 'Pages',
                CATEGORIES: 'Categories',
                TAGS: 'Tags',
                UNTITLED: '(Untitled)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>